{
  "analysis_timestamp": "2025-10-21T13:33:02.301966",
  "methodology": "Real Reddit posts scraped and individually analyzed",
  "total_real_posts_analyzed": 120,
  "brands_with_data": 6,
  "verification_data": {
    "HelloFresh": {
      "total_posts": 20,
      "positive": 20,
      "negative": 0,
      "neutral": 0,
      "real_posts": [
        {
          "title": "Hello fresh referral codes?",
          "text": "https://www.hellofresh.co.uk/freebox/MzM3MjkwNTg5LTAtNC0xMS1HQg\n\nFree box ^ \nAlice Tripp (fake name) ",
          "full_text": "https://www.hellofresh.co.uk/freebox/MzM3MjkwNTg5LTAtNC0xMS1HQg\n\nFree box ^ \nAlice Tripp (fake name) ",
          "score": 0,
          "comments": 0,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1oci6vn/hello_fresh_referral_codes/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.361 | TextBlob: 0.067 | Positive words: ['fresh']",
          "created_utc": 1761065428.0
        },
        {
          "title": "Ghosted by HelloFresh",
          "text": "For the last 2 weeks HelloFresh has just completly stopped delivering to me and they never communicated to me that the deliveries were delayed. I actually had to reach out to HelloFresh on both occasi...",
          "full_text": "For the last 2 weeks HelloFresh has just completly stopped delivering to me and they never communicated to me that the deliveries were delayed. I actually had to reach out to HelloFresh on both occasions.\n\nThey didn’t even issue me a refund until I reached out and asked about missing deliveries 📦. At first they offered me credits but what good are credits if you can’t use them?\n\nIt’s completely unprofessional.",
          "score": 0,
          "comments": 2,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1obcmdh/ghosted_by_hellofresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.180 | TextBlob: 0.142 | Positive words: ['good', 'fresh']",
          "created_utc": 1760941597.0
        },
        {
          "title": "Anyone else notice a decrease in meat quality?",
          "text": "I am in Canada if that makes any difference. I have been getting Hellofresh regularly for about 5 months now. It is super convenient and helps me eat less takeout. \n\nA few months ago, they mentioned t...",
          "full_text": "I am in Canada if that makes any difference. I have been getting Hellofresh regularly for about 5 months now. It is super convenient and helps me eat less takeout. \n\nA few months ago, they mentioned they were going to increase the quality of their meat, which I thought was great. Their meat was never terrible to me (it was fine). Not high quality, but still fine. However, since about a month ago, I have found their meat to be quite awful, particularly the ground meat (including sausage). It seems to be filled with a lot of filler or something because it reminds me almost of hot dogs if they were ripped into pieces, but ofc, the taste is not the same as hot dogs but it also doesn't taste like it should. I have never experienced this with ground meats that I purchased elsewhere... \n\nI am definitely going to cancel next month (my partner asked we do it for the next month as we are busy) and, in the meantime, avoid the ground meats but it is unfortunate because they are often in quicker meals. \n\nHas anyone else noticed this? Or willing to pay attention? ",
          "score": 7,
          "comments": 8,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1ob8d2b/anyone_else_notice_a_decrease_in_meat_quality/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.716 | TextBlob: 0.070 | Positive words: ['great', 'fresh', 'convenient', 'quality'] | Negative words: ['terrible', 'awful']",
          "created_utc": 1760927637.0
        },
        {
          "title": "How do I find out about all of the different special recipes, etc?",
          "text": "I've been doing Hello Fresh for a while.  In the past, I always knew about the different special collections- like the 'Fall Flavors' category, etc.  I remember when I would see snowmen made out of ma...",
          "full_text": "I've been doing Hello Fresh for a while.  In the past, I always knew about the different special collections- like the 'Fall Flavors' category, etc.  I remember when I would see snowmen made out of mashed potatoes, or when there was Hispanic Heritage month, with special meals with South American flavors, etc.  I always read about the collections, got excited about new meals, etc.\n\nToday I was choosing some meals, and I came across something from The Office.  And another one that was like 'Meals with a Purpose' or something like that.  And when they have these, I wonder what the theme is, etc.  Like I saw Kevin's Chili, I assume there are other, similar meals?\n\nWhen my kids were younger, there were a few collections that we really liked.  It was always fun to try the new items to change it up.  There was a Guardians of the Galaxy thing, and I believe we got every meal, because there was some sort of collectible in them.\n\nDoes anyone know where we can read about the new collections?  Like what are all of The Office meals?  ",
          "score": 0,
          "comments": 2,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o8qtn3/how_do_i_find_out_about_all_of_the_different/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.983 | TextBlob: 0.104 | Positive words: ['fresh']",
          "created_utc": 1760671960.0
        },
        {
          "title": "Price Increased too Much",
          "text": "The price increases have gotten out of line with what I am willing to pay for cooking my family dinner.\n\n$13.50 per meal or $12 if you get 6 servings per meal.\n\nFor those prices I can get takeout and ...",
          "full_text": "The price increases have gotten out of line with what I am willing to pay for cooking my family dinner.\n\n$13.50 per meal or $12 if you get 6 servings per meal.\n\nFor those prices I can get takeout and have leftovers.  I never have leftovers with HelloFresh.\n\nWhen cooking for 4-6 people the price for HelloFresh just isn’t worth it anymore.",
          "score": 26,
          "comments": 23,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o8nay6/price_increased_too_much/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.382 | TextBlob: 0.250 | Positive words: ['fresh', 'worth']",
          "created_utc": 1760661754.0
        },
        {
          "title": "Pending Charge- Haven’t Ordered in 2 Years",
          "text": "Saw two charges of $0.00 on my credit card from Hello Fresh. Called my credit card company as I haven’t used Hello Fresh in over 2 years. They said nothing went through. Called Hello Fresh, and their ...",
          "full_text": "Saw two charges of $0.00 on my credit card from Hello Fresh. Called my credit card company as I haven’t used Hello Fresh in over 2 years. They said nothing went through. Called Hello Fresh, and their system verified the last order I had was June 2023.\n\nI locked my credit card for now, but it seems very weird.\n\nAnyone else have any similar experience? ",
          "score": 2,
          "comments": 0,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o7qhli/pending_charge_havent_ordered_in_2_years/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.512 | TextBlob: 0.042 | Positive words: ['fresh']",
          "created_utc": 1760570381.0
        },
        {
          "title": "This has been a terrible experience.",
          "text": "I have never used a meal-prep service like this, so I was excited when a friend got me a $125 gift card for HelloFresh.  I loaded it up and ordered my first week, two meals.  They both came and were d...",
          "full_text": "I have never used a meal-prep service like this, so I was excited when a friend got me a $125 gift card for HelloFresh.  I loaded it up and ordered my first week, two meals.  They both came and were delicious and I was happy.\n\nThen the second week happened.\n\nMy box came, but it only had one of the two meals I had ordered.  When I called Customer Service, I got the news that not only would I not get the meal at all (for \"mistake reasons\"), but my GC had been charged down to zero AND my bank account had been charged as well.  After I groused and yelled and got a supervisor, the company said they'd put the amount of the missing meal back on my gift card, refunded the double billing to my debit card, and that I could resume my experience.\n\nThen the third week happened.\n\nI don't even have resolution yet.  I got an email stating they've cancelled my account and cancelled my delivery for this week.  I haven't talked to customer service yet, but you can believe they're about to get an earful.  Anyone else had this terrible experience?",
          "score": 0,
          "comments": 10,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o7m0r2/this_has_been_a_terrible_experience/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.762 | TextBlob: 0.005 | Positive words: ['delicious', 'fresh', 'happy'] | Negative words: ['terrible', 'cancelled']",
          "created_utc": 1760559635.0
        },
        {
          "title": "What’s the best dish you’ve ever had from HelloFresh?",
          "text": "I’m subscribing again after taking a 6 month break and I’m wondering what I should be on the lookout for. Please share your favorite HelloFresh dinners! Thanks 😊 ",
          "full_text": "I’m subscribing again after taking a 6 month break and I’m wondering what I should be on the lookout for. Please share your favorite HelloFresh dinners! Thanks 😊 ",
          "score": 18,
          "comments": 98,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o7ggfl/whats_the_best_dish_youve_ever_had_from_hellofresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.963 | TextBlob: 0.608 | Positive words: ['fresh']",
          "created_utc": 1760547210.0
        },
        {
          "title": "First order frustration",
          "text": "First time trying HelloFresh.\n\nI received some coupons a few days ago advertising 11 free meals and breakfast for life with a subscription. Sounds good. I created an account, selected my meals and bre...",
          "full_text": "First time trying HelloFresh.\n\nI received some coupons a few days ago advertising 11 free meals and breakfast for life with a subscription. Sounds good. I created an account, selected my meals and breakfast add on and applied the code. Then I noticed something strange. The breakfast add on is still being charged full price. Talked to support and they told me I need to manually select the add on since it's not added automatically. Well that's what I did. It was very clear this support person didn't even read my issue properly. From looking at the posts here, it seems the free breakfast is on a different tab, but I never saw it- hence my immense confusion. The dodgy answer from support also didn't help.\n\nRegardless I asked them to cancel my order and my subscription. No thanks. Hope y'all are enjoying this but  it isn't worth it for me.",
          "score": 0,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o5yz8g/first_order_frustration/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.270 | TextBlob: 0.195 | Positive words: ['good', 'fresh', 'worth']",
          "created_utc": 1760396099.0
        },
        {
          "title": "Rant? All my selected meals reset",
          "text": "I just had a not-so-great experience with customer service for the past 45 minutes. I go to the app and every meal I selected for the next 5 weeks has been reset and changed to different ones. Coincid...",
          "full_text": "I just had a not-so-great experience with customer service for the past 45 minutes. I go to the app and every meal I selected for the next 5 weeks has been reset and changed to different ones. Coincidence/app issue? I’m 100% sure that they’re all different. I enjoy choosing them early and had them all picked for the next 5 deliveries. \n\nI want to be HelloFresh’s #1 fan but 4 weeks of opened leaking chicken and not great customer service is so disappointing. I love the idea of it so much and want to continue being a customer",
          "score": 2,
          "comments": 7,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o5yrhf/rant_all_my_selected_meals_reset/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.149 | TextBlob: -0.012 | Positive words: ['love', 'great', 'fresh']",
          "created_utc": 1760395545.0
        },
        {
          "title": "please send unwanted recipe pages",
          "text": "my husband and I used to love getting HelloFresh. it was easy to do and helped us with meal planning. the only downside is the huge amounts of sodium used in every meal so we stopped getting it. we ke...",
          "full_text": "my husband and I used to love getting HelloFresh. it was easy to do and helped us with meal planning. the only downside is the huge amounts of sodium used in every meal so we stopped getting it. we kept a binder with our favorite recipes and looked into a healthier option so we tweak the recipes and meal prep for the week. but we want to update our recipe book. is there anyone willing to send their recipes our way? thanks in advance!",
          "score": 5,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o556yz/please_send_unwanted_recipe_pages/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.872 | TextBlob: 0.333 | Positive words: ['love', 'fresh', 'easy']",
          "created_utc": 1760314799.0
        },
        {
          "title": "Best way to get a box refunded?",
          "text": "\nTLDR; how do I get a box that I forgot to skip refunded after it shows up? Just call in and tell them half the ingredients were rotten? Tell them they forgot to put ice in the box? Tell them none of ...",
          "full_text": "\nTLDR; how do I get a box that I forgot to skip refunded after it shows up? Just call in and tell them half the ingredients were rotten? Tell them they forgot to put ice in the box? Tell them none of the meat was in there? Dispute it on my credit card? I don’t care if it’s unethical. Read below if you wanna know what lead to me being this discontent with them.  \n\nHey there, I’m greatly disappointed with HelloFresh’s customer service level. I signed me and my wife up for 4 meals a week under the free caraway pan promo. I understand that you are eligible for the pan after your 3rd box and a redemption code will be sent to your email within 14 days after receiving the 3rd box.\n\nI started the subscription 8 weeks ago. I bought the first 5 boxes when when I still hadn’t got a code I decided to pause until I received my promo so I had skipped what would be the 6th and 7th box and reached out twice over email asking about the caraway code. The first email never got a response, the second email literally said nothing other than the phone number to call into support. I tried to call but it was out of office hours so I didn’t speak to anyone. I’ve been working a lot lately so it fell to the back of my mind for a couple days as I planned on calling them later on. Well then I seen a charge notification go through on my Apple Pay. This was for the next box (what would be #8) I will admit that I forgot to skip it on my end. The charge took place around midnight so the phone line was closed but I made sure to reach out to them at 8am the following morning. The lady asked me why I wanted to skip and I told her that I meant to skip because 1. I haven’t received my pan promo I signed up for 2. Because since it was meant to be skipped we didn’t go select the meals and due to my wife dietary restrictions 2 or the 4 meals that were auto selected wouldn’t be useable for us anyways. \n\nShe then told me they are getting more pan codes and that I should have one soon but to call back in 3-5 days if I haven’t got it yet, well ok. Now I will say she was very nice on the phone but when moved we onto the box I was trying to cancel she told me that it couldn’t be done because the box was already made?! (Keep in mind this was on Thursday morning and my box shows up Monday so I’m pretty sure that’s a lie. I expressed that it’s wild that they force me be ok with it when I reached out less than 12 hours after the charge and the box is still days away from being shipped but when It comes to them being weeks late on my pan I’m suppose to just be alright with a sorry and continue to wait on the premise “we we get it to you eventually”. She apologized but restated there was nothing she could do other than bring up my feedback. I told her I just wanted my pan and that outside of that I would be canceling my service with them. How to do get my money back on this box? I understand I’m a fault for not skipping it in time but there should have been some sort of resolution available other than tough luck, especially given that I’ve been patient with them not holding up their end of the bargain on my promo. ",
          "score": 0,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o4n9ej/best_way_to_get_a_box_refunded/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.983 | TextBlob: 0.093 | Positive words: ['great', 'fresh'] | Negative words: ['disappointed']",
          "created_utc": 1760270509.0
        },
        {
          "title": "Shrimp dishes disappearing",
          "text": "I subscribe to HelloFresh Sweden. I realized that my planned shrimp dishes have disappeared and shrimp has been replaced with cod in the recepies. There is also no shrimp recept left. Has anyone else ...",
          "full_text": "I subscribe to HelloFresh Sweden. I realized that my planned shrimp dishes have disappeared and shrimp has been replaced with cod in the recepies. There is also no shrimp recept left. Has anyone else experienced the same thing?",
          "score": 1,
          "comments": 7,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o4jd6v/shrimp_dishes_disappearing/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.477 | TextBlob: 0.267 | Positive words: ['fresh']",
          "created_utc": 1760256246.0
        },
        {
          "title": "Homemade Salami and Mozzarella Focaccia Pizza",
          "text": "Holy smokes this was hands down one of the best recipes HelloFresh has ever had. I LOVED making it and let me tell you I haven't baked bread before (only cakes/cookies/brownies/pies) and it was stupid...",
          "full_text": "Holy smokes this was hands down one of the best recipes HelloFresh has ever had. I LOVED making it and let me tell you I haven't baked bread before (only cakes/cookies/brownies/pies) and it was stupid easy. So delicious. If you see this one come around again, I HIGHLY recommend you get it and give it a try!",
          "score": 53,
          "comments": 20,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o49oaf/homemade_salami_and_mozzarella_focaccia_pizza/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.953 | TextBlob: 0.297 | Positive words: ['love', 'recommend', 'delicious', 'fresh', 'easy']",
          "created_utc": 1760224350.0
        },
        {
          "title": "Potato &amp; mushroom soup - fall flavors menu",
          "text": "I didn’t take any photos but it was a really great Hello Fresh meal &amp; I’m not usually that into soups. Very hearty, flavorful, lots of veggies. Highly recommend! 🧑‍🍳",
          "full_text": "I didn’t take any photos but it was a really great Hello Fresh meal &amp; I’m not usually that into soups. Very hearty, flavorful, lots of veggies. Highly recommend! 🧑‍🍳",
          "score": 6,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2oakx/potato_mushroom_soup_fall_flavors_menu/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.937 | TextBlob: 0.325 | Positive words: ['great', 'recommend', 'fresh']",
          "created_utc": 1760061112.0
        },
        {
          "title": "Other Meal Kits",
          "text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc...",
          "full_text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc) ",
          "score": 7,
          "comments": 15,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
          "created_utc": 1760059421.0
        },
        {
          "title": "Hello Fresh Ready Made Meals",
          "text": "I don’t see Ready Made Meals from coming weeks’ menu.\nAnybody knows what happened?\nI saw there was recall. Is it related to that? Are they coming back?",
          "full_text": "I don’t see Ready Made Meals from coming weeks’ menu.\nAnybody knows what happened?\nI saw there was recall. Is it related to that? Are they coming back?",
          "score": 7,
          "comments": 8,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2mbhy/hello_fresh_ready_made_meals/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.781 | TextBlob: 0.140 | Positive words: ['fresh']",
          "created_utc": 1760055427.0
        },
        {
          "title": "Just reactivated five days ago and got this...🤦",
          "text": "Just reactivated our Hello Fresh five days ago after several years off and got this offer in the mail today 🙄🤦",
          "full_text": "Just reactivated our Hello Fresh five days ago after several years off and got this offer in the mail today 🙄🤦",
          "score": 4,
          "comments": 2,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2jobu/just_reactivated_five_days_ago_and_got_this/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.318 | TextBlob: 0.150 | Positive words: ['fresh']",
          "created_utc": 1760048259.0
        },
        {
          "title": "It took me 1 kit to realize I got scammed by hello fresh",
          "text": "So a few weeks ago a hello fresh salesman was at my door. And he sold me the box with next liner: we supply you with food from your local farmers so you can eat cheaper and healthier. \nWhen I asked wh...",
          "full_text": "So a few weeks ago a hello fresh salesman was at my door. And he sold me the box with next liner: we supply you with food from your local farmers so you can eat cheaper and healthier. \nWhen I asked which local farmers he couldn’t answer the question immediately, he stuttered and in my believe he made up his answer. \nMaybe it was the location of the depot? \nAnyway, today I received my box and I went on a mission: is it really local food? \nNope, France, Spain, Netherlands, UK but no Belgium spotted. Do they really are that convinced that we are that dumb? 😂 \n",
          "score": 3,
          "comments": 28,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1o7nait/it_took_me_1_kit_to_realize_i_got_scammed_by/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.447 | TextBlob: 0.025 | Positive words: ['fresh']",
          "created_utc": 1760562518.0
        },
        {
          "title": "Best meal kit when it comes to price and health?",
          "text": "I'm not too knowledgeable about meal kits and am trying to learn about them. The one I've seen often is hellofresh.\n\nWhich meal kit would you recommend if I'm trying to keep costs low? I've done a bit...",
          "full_text": "I'm not too knowledgeable about meal kits and am trying to learn about them. The one I've seen often is hellofresh.\n\nWhich meal kit would you recommend if I'm trying to keep costs low? I've done a bit of research but a lot of people talk about taste, but I don't really care about that. For example I've heard hellofresh is repetitive but I don't really mind that. I'm mostly just looking for one that is maybe a bit on the cheaper side, but obviously still good quality.\n\nAlso portion, depends on the price, but I've heard some meal kits have really small portions, which I would like to avoid if I can. I know there isn't some amazing meal kit thats dirt cheap, but I would like to learn about different meal kits before deciding about one.\n\nNot ready made or ready made, either one is fine.",
          "score": 8,
          "comments": 14,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1mze27l/best_meal_kit_when_it_comes_to_price_and_health/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.178 | TextBlob: 0.241 | Positive words: ['amazing', 'good', 'recommend', 'fresh', 'quality']",
          "created_utc": 1756086873.0
        }
      ]
    },
    "Factor": {
      "total_posts": 20,
      "positive": 18,
      "negative": 2,
      "neutral": 0,
      "real_posts": [
        {
          "title": "No ready made meals, second week in a row!",
          "text": "I've been ordering two cooking meals and a ready-made meal each week because my husband is back in the office now. However, last week the package arrived with two meals, none of which were ready-made ...",
          "full_text": "I've been ordering two cooking meals and a ready-made meal each week because my husband is back in the office now. However, last week the package arrived with two meals, none of which were ready-made meals. I called, they credited my account, and I figured life was good. This week, the same thing, no ready-made meal, just two meals. \n\nAnd then I went to order the next month's meals, and there are no ready-made meals to pick from, but a push for us to order from Factor\\_. \n\nHave they given up on Ready-Made meals and are pushing those who like ready-made meals to their sister company, Factor\\_?",
          "score": 2,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1ocebt8/no_ready_made_meals_second_week_in_a_row/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.540 | TextBlob: 0.086 | Positive words: ['good']",
          "created_utc": 1761056572.0
        },
        {
          "title": "Customer Service",
          "text": "Hello Fresh food delivery service was a bust for me. Had a coupon for 2 weeks free meals including shipping and one week cost me $178. It was supposed to cover 8 meals, but by mistake I ordered 8 meal...",
          "full_text": "Hello Fresh food delivery service was a bust for me. Had a coupon for 2 weeks free meals including shipping and one week cost me $178. It was supposed to cover 8 meals, but by mistake I ordered 8 meals for 2, 16 meals, so 8 extra meals cost me $178. No credit from customer service. I had Factor and much better deal and service. Website still shows me with a free week of meals benefit and one was used, not much of a savings when it costs $178 instead of free to try. I can't afford another free week so I cancelled. Not Hello Fresh...Goodbye Fresh!",
          "score": 0,
          "comments": 1,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o0hmog/customer_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.794 | TextBlob: 0.297 | Positive words: ['good', 'fresh'] | Negative words: ['cancelled']",
          "created_utc": 1759850191.0
        },
        {
          "title": "BBQ Pineapple Flatbreads",
          "text": "It has good flavor but nothing stood out to me. No wow factor, I think adding chicken sausage would make it better. \n\nIt needed some meat but didn’t want to pay an upgrade for it.  ",
          "full_text": "It has good flavor but nothing stood out to me. No wow factor, I think adding chicken sausage would make it better. \n\nIt needed some meat but didn’t want to pay an upgrade for it.  ",
          "score": 31,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1mxr56r/bbq_pineapple_flatbreads/",
          "sentiment": "positive",
          "confidence": 0.6,
          "explanation": "VADER: 0.139 | TextBlob: 0.137 | Positive words: ['good']",
          "created_utc": 1755920648.0
        },
        {
          "title": "Anyone have a business email for Hello Fresh YT partnerships?",
          "text": "Hello! I'm an influencer who has done integrations with the Hello Fresh and Factor brands before, and I thought they would be PERFECT for a big video I have coming up on eccentric (but effective) heal...",
          "full_text": "Hello! I'm an influencer who has done integrations with the Hello Fresh and Factor brands before, and I thought they would be PERFECT for a big video I have coming up on eccentric (but effective) healthy eating habits -- but I was super disappointed to see that my old contact email doesn't work anymore :( Does anyone here have a working email address they can send me so I can reach back out again?",
          "score": 0,
          "comments": 0,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1mql5tc/anyone_have_a_business_email_for_hello_fresh_yt/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.960 | TextBlob: 0.142 | Positive words: ['fresh'] | Negative words: ['disappointed']",
          "created_utc": 1755225387.0
        },
        {
          "title": "HF vs Shopping",
          "text": "I am curious... I've been seeing posts of folks who have canceled HF and gone back to meal planning and in store grocery shopping. \n\nMy curiosity is this: \n-What are your costs now vs kit price (equal...",
          "full_text": "I am curious... I've been seeing posts of folks who have canceled HF and gone back to meal planning and in store grocery shopping. \n\nMy curiosity is this: \n-What are your costs now vs kit price (equal number of meals and servings)\n-How do you plan your meals to not waste ANY food\n-What geographic location are you (in terms of, grocery nearby or travel costs to get somewhere say, 30 minutes away)\n-Are you in a food desert or Do you have access to higher quality ingredients \n-How are you sourcing harder to find items, like stock packets or other meal kit only items (and are you factoring a mass online buy into your cost of meals/servings)\n\n\n\n",
          "score": 6,
          "comments": 37,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1m2eu2e/hf_vs_shopping/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.753 | TextBlob: 0.003 | Positive words: ['quality'] | Negative words: ['waste']",
          "created_utc": 1752775858.0
        },
        {
          "title": "It’s been real y’all 🥲 any alternative success??",
          "text": "My meal prices have been unknowingly increased to $12.49/serving, didn’t even receive an email about this. I found out after perusing this subreddit and seeing people upset about a $10.99 serving pric...",
          "full_text": "My meal prices have been unknowingly increased to $12.49/serving, didn’t even receive an email about this. I found out after perusing this subreddit and seeing people upset about a $10.99 serving price. \n\nThat’s the price of living in a high traffic area like Seattle I guess. I’ve seen a lot of people get factor delivered to their apartments. Maybe I’ll try that 😅\n\nI just don’t have time to meal plan/shop for groceries. I work 12:30-9:00pm so most stores are closed by the time I get home from work. I would live off Trader Joe’s, if only they stayed open an extra hour. Any ideas for alternatives would be great\n\nGonna miss some of these meals though, I’ve been a customer on and off for nearly 3 years. Just can’t justify the prices , especially upwards of $50 for a premium meal for 2. I might as well go out to eat and have a nice meal I don’t have to cook (avoiding that is the entire motivator of why I signed up for this!!). \n\nI like the variety of some of these meals, and getting to use ingredients I otherwise would waste buying in bulk, so alternative suggestions (or links to other similar forums) is appreciated. And please tell me what you typically pay for these alternatives (if comfortable)! I like details like that. ",
          "score": 11,
          "comments": 20,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1m1762v/its_been_real_yall_any_alternative_success/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.979 | TextBlob: 0.145 | Positive words: ['great'] | Negative words: ['waste']",
          "created_utc": 1752654353.0
        },
        {
          "title": "HelloFresh alternatives that let you view upcoming menus before charging your CC?",
          "text": "Have been a HF subscriber for years, but looking into alternatives (mainly bc I’ve become bored with repeated recipes &amp; almost everything that peaks my interest has some sort of an up charge now)....",
          "full_text": "Have been a HF subscriber for years, but looking into alternatives (mainly bc I’ve become bored with repeated recipes &amp; almost everything that peaks my interest has some sort of an up charge now).\n\nWas previously a MarleySpoon subscriber, but saw a significant decrease in ingredients quality, so moved back to HF.\n\nI get free meals from my work through Factor that I opt out of bc I physically cannot stomach them (I think they’re awful) &amp; I don’t want to waste food. \n\nWas leaning towards HomeChef, but they want my CC details to charge before I can even view upcoming weeks menus.\n\nHoping for some suggestions 🙏",
          "score": 0,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1lcvxbd/hellofresh_alternatives_that_let_you_view/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.710 | TextBlob: -0.103 | Positive words: ['fresh', 'quality'] | Negative words: ['awful', 'waste']",
          "created_utc": 1750087940.0
        },
        {
          "title": "Factor was originally offered at the same price point on HelloFresh a few months ago, but I’ve recently noticed a $2.99 upcharge per serving. Is this happening everywhere or just in Canada?",
          "text": "",
          "full_text": "",
          "score": 1,
          "comments": 0,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1lcgqi5/factor_was_originally_offered_at_the_same_price/",
          "sentiment": "positive",
          "confidence": 0.6,
          "explanation": "VADER: 0.000 | TextBlob: 0.044 | Positive words: ['fresh']",
          "created_utc": 1750037991.0
        },
        {
          "title": "Quality rant from 7 year customer",
          "text": "Want to start off by saying that I obviously enjoy using Hellofresh, having been a customer since 2018. When I got my first place a couple of years ago, Hellofresh was super useful to mitigate some of...",
          "full_text": "Want to start off by saying that I obviously enjoy using Hellofresh, having been a customer since 2018. When I got my first place a couple of years ago, Hellofresh was super useful to mitigate some of the stress of moving in and figuring out what to cook. I also greatly improved my cooking ability over the years thanks to the recipes.\n\nWhich makes it all the more sad to see the current state of things. I read their latest available annual report where they suggest that they’re trying to increase revenue of recurring (aka loyal) customers through up charges like marketplace and premium meals. \n\nI remember when premium meals were first introduced, and they legitimately felt “premium” given the volume and quantity of food you receive. Things like the salmon Wellington for example were quite elaborate and felt unique. Nowadays half the options are premium, often times completely inexplicably. I don’t understand how adding 3 strips of bacon to an otherwise typical meal justifies a $10 up charge. I understand that they barely increased the base box prices over almost a decade, but honestly I would rather the base increase than have every decent looking meal be an upcharge. \n\nThe ingredient quantity and quality has also plummeted. The meat I receive is just plain gross to the point that I absolutely dread opening the meat packets. I’m actually in awe every time I buy grocery store ground beef and notice the pleasant smell and lack of sliminess compared to what HF is sending. And we all know about the “shredded chicken” scraps they send by now.\n\nThere are also notable omissions from recipes when you compare to years ago. One easy example is the salsas that come with Mexican dishes - often times the “salsa” is just a diced up tomato soaked in lime juice. In years past they’d set you up with a full pico de gallo.\n\nThen there’s small details which aren’t super relevant, but cheapen the overall experience. Lately I’ve been getting TreStelle “cream cheese product” instead of actual cream cheese. I would never buy and ingest this junk on my own volition, yet I use it through HF. Honey and vinegar used to come in miniature bottles, now they’re just blank transparent packets. Not the end of the world, but kind of crummy for a meal kit that used to be positioned as the premium option.\n\nEven though the menu is multiple times bigger than what it used to be years ago, it is substantially harder to decide on 3-5 meals that aren’t just week to week repeats. Also, they decided to pollute the menu options with factor meals - if I wanted to order factor, I’d order factor. They should at minimum be tucked away behind a tab like the marketplace items.\n\nAnyway, I just felt like sharing my perspective on what I see as a major degradation in a once amazing service. I hope that they can recover but it’s surely not easy in these economic times.",
          "score": 79,
          "comments": 22,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1k315j0/quality_rant_from_7_year_customer/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.984 | TextBlob: 0.110 | Positive words: ['great', 'amazing', 'fresh', 'quality', 'easy']",
          "created_utc": 1745082658.0
        },
        {
          "title": "My box was delivered in a Factor van",
          "text": "Thought it was interesting to finally see, that’s all!",
          "full_text": "Thought it was interesting to finally see, that’s all!",
          "score": 4,
          "comments": 7,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1k035lb/my_box_was_delivered_in_a_factor_van/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.457 | TextBlob: 0.250",
          "created_utc": 1744751305.0
        },
        {
          "title": "Ready to heat meals?",
          "text": "I've been curious on these meals. There is always like 3 on my page. Are they any good? Are they just factor meals? \nAnyone order these before ",
          "full_text": "I've been curious on these meals. There is always like 3 on my page. Are they any good? Are they just factor meals? \nAnyone order these before ",
          "score": 10,
          "comments": 12,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1jg45v2/ready_to_heat_meals/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.867 | TextBlob: 0.267 | Positive words: ['good']",
          "created_utc": 1742516734.0
        },
        {
          "title": "Blue Apron v. Hello Fresh",
          "text": "I’m posting this comparison in both Blue Apron and Hello Fresh subs. I get both meal kits delivered alternating weeks and have used the services for three months. Hello Fresh (HF) delivers to me on Sa...",
          "full_text": "I’m posting this comparison in both Blue Apron and Hello Fresh subs. I get both meal kits delivered alternating weeks and have used the services for three months. Hello Fresh (HF) delivers to me on Saturday, and Blue Apron (BA) on Friday.  I enjoy both and will continue to get both because they have different strengths. I am single and order two meals per week, and they last for a minimum of four dinners.\n\nTLDR:\n\nSingle? Blue Apron or both, like me!\n\nFamily?  Hello Fresh  \n\n**Overall Winner: Hello Fresh** \n\n**Recipe Quality**\n\nFresh meats and veggies from both.\n\nHF offers more family-friendly foods with the same base: chicken, pork, potato wedges, mashed potatoes, and broccoli.\n\nBA offers much fancier recipes with unusual ingredients – perfect for impressing a date or cooking together. I love eating fancy foods with flair!\n\nWinner: BA\n\n**Number of recipes**\n\nHands down, HF offers far more recipes.  For 3/15/25, there are approximately 62 meals, six of those are prepared microwaveable meals, and three are prep and bake.\n\nBA offers 20 options. Two are ready to cook, and none are microwaveable.\n\nWinner: HF\n\n**Premium meals**\n\nBecause HF offers many more meals, more are premium than BA. From my experience, all of the meals involving fish are considered premium and cost more (approximately $9 more per serving). BA routinely includes fish in its base price (shrimp, codfish, tilapia, and salmon) and I love fish and not having to pay extra for it with BA.\n\nLooking at the menu, BA offers only one premium meal: Duck Confit &amp; Coconut Curry Ramen, which costs $18.98 per serving. \n\nHF has six premium meals, including Shoyu-Style Ramen with Sesame-Soy Salmon for 8.99 per service.\n\nThe recipes HF charges extra for would typically be part of BA’s base plan.  I have not ordered premium meals from either.\n\nWinner: Tie.  HF is cheaper and has more options.  But fish is standard fare for BA and is always offered.\n\n**Specialty Meals:**\n\nLooking for big-batch meals, casseroles, or slow-cooker options: HF.  BA doesn’t offer these.\n\nWinner: HF\n\n**Add ons:** \n\nBoth have upsells after you’ve selected your meals for the week, but HF has many more options: smoothies (sometimes sold out), breakfast items, and decadent desserts.  I’ve ordered desserts from HF twice: blueberry cake and hazelnut cheesecake.  I ordered one and received two servings of each. The cake was microwaveable. Both were delicious but high in calories and fat, which isn’t viewable online.\n\nWinner: HF  \n\n**Order correctness**\n\nThere have been no issues with HF yet. BA has sent me the wrong delivery once. I was looking forward to my salmon meal, too. Instead of one, I received three meals instead of two, including fried chicken, falafel salad, and chorizo enchiladas. I try to stay on the lighter side of calories, but of course, I made the dishes. BA responded quickly via email and refunded my meal for that week. \n\nWinner:  HF\n\n**Packaging** \n\nI love HF’s packaging!  Both of my recipes come in separate brown paper bags. I can just open the box and pop the bags in the fridge.  Look underneath the cardboard divider for meats and pop in the freezer. \n\nBA just tosses all the individual ingredients in a box like: YOU figure it out! \n\nI like that BA lets you know the ice product is sink-friendly.  HF does not say that, so I toss the heavy packaging.\n\nWinner: HF\n\n**App** \n\nBoth apps are easy to navigate and have the recipes cards in the app in the event you lose yours.  They both have filters so you can get to your low-calorie, vegetarian or Bestseller meals quickly. I like that HF's front menu page shows the calorie content. \n\nWinner HF \n\n**Repetitiveness** \n\nI’ve been using the services for three months and still haven’t bought the same meal twice, although I easily could. Because HF has so many options, many are repeated often. The Honey Onion Crunch Chicken is almost always on the menu. That was my first dish, and it is an easy-to-make one-pan meal and delicious! I can’t wait to have it again. \n\nBA doesn’t repeat meals as often, but its unique ingredients make regular appearances. So, it has multiple recipes that use the same ingredients in its stock.\n\nWinner: BA has less repetitive/boring recipes even if they reuse ingredients.\n\n**Affordability** \n\nI order two meals each week from each (which is four meals). I think I’m still getting a discount from HF and pay about $55. BA is $10-12 more. Sometimes, with HF, I order an extra microwaveable meal for about $8 (two meals). When my HF discount is over, I should be paying about $10 more. \n\nBA is more expensive. But the quality of their food and recipes justify the price. I do wish they’d spend money on brown paper bags for individual recipes like HF. \n\nWinner: HF \n\n**Taste** \n\nBoth have good meals, and I’m saving all of my recipe cards in a binder and making notes on them (although you can save them in the app, too.)  Nothing has been awful, just items I don’t prefer: like lettuce wraps from HF.  If you’re looking for the wow factor, that’s Blue Apron.\n\nWinner:  BA\n\n",
          "score": 24,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1j6tuki/blue_apron_v_hello_fresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.999 | TextBlob: 0.136 | Positive words: ['love', 'good', 'delicious', 'fresh', 'quality', 'easy'] | Negative words: ['awful', 'issues']",
          "created_utc": 1741475949.0
        },
        {
          "title": "Is the free pre-made meal or free breakfast item for life a better deal?",
          "text": "I am returning after years of being away and I have both promos in my inbox. I feel like the pre-made meal might be best because I work, but the reviews here weren't very good (but if they really are ...",
          "full_text": "I am returning after years of being away and I have both promos in my inbox. I feel like the pre-made meal might be best because I work, but the reviews here weren't very good (but if they really are from Factor, all my friends really like them so I'm willing to take the risk). \n\nIs the free breakfast item pre-made or do I have to cook it myself? The reviews seem good. But I'd rather have lunch than breakfast.",
          "score": 6,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1j0kb5z/is_the_free_premade_meal_or_free_breakfast_item/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.964 | TextBlob: 0.496 | Positive words: ['good']",
          "created_utc": 1740782055.0
        },
        {
          "title": "Italian chicken over lemony spaghetti 1/10",
          "text": "This meal sucked. The only sauce you use is half a cup of pasta cooking water, one packet of stock concentrate, one packet of sour cream, one tablespoon butter, and some lemon juice. The second pictur...",
          "full_text": "This meal sucked. The only sauce you use is half a cup of pasta cooking water, one packet of stock concentrate, one packet of sour cream, one tablespoon butter, and some lemon juice. The second picture shows how much sauce you have before you simmer it down, for one pound of spaghetti and two chicken cutlets. It was completely devoid of flavor because there was not enough sauce by a factor of like 75%. It needed more than triple the amount of sauce it had. It said to keep adding pasta water until it was creamy, but I was just watering down water sauce by that point. Horrible. Don’t get this. It needed diced tomatoes too. HF used to give tomatoes with meals like this but now they don’t. Meals like this are why I’m skipping most weeks now. I’m not going to keep paying for bare bones meals that I have to supplement with produce and sauce. ",
          "score": 0,
          "comments": 36,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1hxmys6/italian_chicken_over_lemony_spaghetti_110/",
          "sentiment": "positive",
          "confidence": 0.6,
          "explanation": "VADER: 0.128 | TextBlob: -0.105 | Negative words: ['horrible']",
          "created_utc": 1736456004.0
        },
        {
          "title": "Looking for some additional opinions. ",
          "text": "So my order was delayed by a day then showed up like someone punched the top of the box. \n\nWould y’all eat it or skip? I’m leaning towards asking for a refund and skipping but I wanted to get some oth...",
          "full_text": "So my order was delayed by a day then showed up like someone punched the top of the box. \n\nWould y’all eat it or skip? I’m leaning towards asking for a refund and skipping but I wanted to get some other opinions to see if I’m being too anxious or reasonable. \n\nIt’s been between 24-40° the past few days, mostly the lower end of the range though if that is part of the deciding factor. ",
          "score": 0,
          "comments": 31,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1hx4jek/looking_for_some_additional_opinions/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.557 | TextBlob: 0.054",
          "created_utc": 1736396193.0
        },
        {
          "title": "Best meal prep service?",
          "text": "I’m looking to gift a meal prep service to a young family with toddler and newborn. Is hello fresh/factor the best way to go? Any recommendations for other services? TIA",
          "full_text": "I’m looking to gift a meal prep service to a young family with toddler and newborn. Is hello fresh/factor the best way to go? Any recommendations for other services? TIA",
          "score": 1,
          "comments": 7,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1hdrmg1/best_meal_prep_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.951 | TextBlob: 0.494 | Positive words: ['recommend', 'fresh']",
          "created_utc": 1734139237.0
        },
        {
          "title": "Curious as to what users think about this idea: Nutrition tracking barcode on HelloFresh's recipe",
          "text": "As someone who tries to be cognizant of their caloric and macronutrient intake, I think it would be super convenient for HelloFresh to add a barcode component on their recipes, where customers can sca...",
          "full_text": "As someone who tries to be cognizant of their caloric and macronutrient intake, I think it would be super convenient for HelloFresh to add a barcode component on their recipes, where customers can scan to automatically input the meal's macronutrient information added into a fitness app such as MyFitnessPal, MacroFactor, etc. This would probably require some sort of API connection between HelloFresh's mobile app and the partner of their choice - but it would be super helpful for those who care about tracking their consumption!",
          "score": 7,
          "comments": 1,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1g0o564/curious_as_to_what_users_think_about_this_idea/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.960 | TextBlob: 0.110 | Positive words: ['fresh', 'convenient', 'helpful']",
          "created_utc": 1728581105.0
        },
        {
          "title": "Do You Ever Think Missing Boxes Were Merely Stolen By Delivery Partners?",
          "text": "I've had this service for 2 to 3 years now and in the past 365 days, my weekly box has gone missing about 5 or 6 times. Not a lot, but there is a pattern. Every time my box goes missing it's through t...",
          "full_text": "I've had this service for 2 to 3 years now and in the past 365 days, my weekly box has gone missing about 5 or 6 times. Not a lot, but there is a pattern. Every time my box goes missing it's through the same delivery partner, FarEye. UPS, FedEx, \\_Factor... all of them have never missed the mark, but FarEye has a really high failure rate for me specifically (been at the same address). From my POV here's what happens:\n\nI get a notification that my box is out for delivery and a tracking link, later I get a notification the box was devlivered, look on my porch and it isn't there, check the devlivery link and the picture the FarEye driver is required to take isn't even a picture of the box; it's usually a picture of them pointing their camera at a random house while they drive or a picture of the inside of their trunk. I leave a one-star report, call customer service and get refunded. \n\nSo, it all works out in the end, but the fact that it's only ever FarEye and my box goes missing, not because it was delivered to a wrong address (signified by a picture of my box on someone else's door-step), but because the person flat out did not deliver the box... it seems convenient in a non-tinfoil-hat way. It's my head cannon that maybe FarEye just has low hiring standards and maybe some people are like, hey, free food for me!",
          "score": 3,
          "comments": 2,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1fzdtr0/do_you_ever_think_missing_boxes_were_merely/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.876 | TextBlob: -0.138 | Positive words: ['convenient']",
          "created_utc": 1728430313.0
        },
        {
          "title": "Already prepped meals?",
          "text": "Similar to factor and a prepared and ready option from Blue Apron, I got an ad that HF now has this option too. I can’t find info on their website about it but I keep getting targeted ads. Can anyone ...",
          "full_text": "Similar to factor and a prepared and ready option from Blue Apron, I got an ad that HF now has this option too. I can’t find info on their website about it but I keep getting targeted ads. Can anyone help?",
          "score": 3,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1dy8k77/already_prepped_meals/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.728 | TextBlob: 0.067",
          "created_utc": 1720444261.0
        },
        {
          "title": "Any Factor/ hello fresh Workers from Aurora Illinois in this group? ",
          "text": "",
          "full_text": "",
          "score": 1,
          "comments": 1,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1dnlc1z/any_factor_hello_fresh_workers_from_aurora/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.318 | TextBlob: 0.300 | Positive words: ['fresh']",
          "created_utc": 1719255529.0
        }
      ]
    },
    "ButcherBox": {
      "total_posts": 20,
      "positive": 14,
      "negative": 5,
      "neutral": 1,
      "real_posts": [
        {
          "title": "Pairing two meal kit services (Butcherbox + _____)",
          "text": "I’ve recently moved to an area of LA with pretty bad grocery store selection. Finding good quality meat around here is tough, so I’m looking into butcherbox. Do y’all have any ideas on pairing one mea...",
          "full_text": "I’ve recently moved to an area of LA with pretty bad grocery store selection. Finding good quality meat around here is tough, so I’m looking into butcherbox. Do y’all have any ideas on pairing one meal prep service with butcherbox in a way which reduces waste? Any recommendations?",
          "score": 4,
          "comments": 1,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/17imysi/pairing_two_meal_kit_services_butcherbox/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.264 | TextBlob: -0.056 | Positive words: ['good', 'recommend', 'quality'] | Negative words: ['bad', 'waste']",
          "created_utc": 1698526788.0
        },
        {
          "title": "Continue HelloFresh or switch to Butcher Box?",
          "text": "My wife and I are paying $81 a week/$324 a month for 8 servings a week. We enjoy the meals and with a newborn in the house, having everything at are door is a great convenience. In the box they had th...",
          "full_text": "My wife and I are paying $81 a week/$324 a month for 8 servings a week. We enjoy the meals and with a newborn in the house, having everything at are door is a great convenience. In the box they had the good chops coupon. It got me thinking about simply getting the meats delivered and buying the side items ourself. It seems like good chips meats are not always sourced from the best places, and Butcher Box seems to be better quality based on reviews I’ve read. I’m wondering if anyone has found it more economical to simply get the meat and buy the sides from the store. In the near future, we are considering starting a small home garden and hopefully growing our sides. Looking forward to hear if anyone has experienced this shift or any additional thoughts to consider. Thanks! ",
          "score": 7,
          "comments": 19,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1iawikc/continue_hellofresh_or_switch_to_butcher_box/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.982 | TextBlob: 0.362 | Positive words: ['great', 'good', 'fresh', 'quality']",
          "created_utc": 1737942074.0
        },
        {
          "title": "Sirloin steaks - always disappointing?",
          "text": "I grew up eating sirloin steaks (because it was inexpensive) but I don't remember it ever being the disappointment that I've had with Gobble and previously with ButcherBox. The steaks I've gotten have...",
          "full_text": "I grew up eating sirloin steaks (because it was inexpensive) but I don't remember it ever being the disappointment that I've had with Gobble and previously with ButcherBox. The steaks I've gotten have sinew and or veins making them difficult to cut with a steak knife, let alone chew. Is this bad luck or does this seem to be the norm for sirloin steaks in 2-person meal kits?",
          "score": 3,
          "comments": 4,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/orotvj/sirloin_steaks_always_disappointing/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.942 | TextBlob: -0.513 | Negative words: ['bad']",
          "created_utc": 1627263809.0
        },
        {
          "title": "Get a $30 discount off Butcher Box with this survey!",
          "text": "",
          "full_text": "",
          "score": 1,
          "comments": 0,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/830wam/get_a_30_discount_off_butcher_box_with_this_survey/",
          "sentiment": "neutral",
          "confidence": 0.7,
          "explanation": "VADER: 0.000 | TextBlob: 0.000",
          "created_utc": 1520542389.0
        },
        {
          "title": "I need Bacon related recipes!!! I was accidentally shipped 50lbs of bacon",
          "text": "Butcherbox accidentally shipped me 50 lbs of bacon, I don't have freezer space for it all. Help me utilize it all",
          "full_text": "Butcherbox accidentally shipped me 50 lbs of bacon, I don't have freezer space for it all. Help me utilize it all",
          "score": 9,
          "comments": 51,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/lxz41a/i_need_bacon_related_recipes_i_was_accidentally/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.455 | TextBlob: 0.000",
          "created_utc": 1614902554.0
        },
        {
          "title": "What is the ideal temperature for the refrigerator?",
          "text": "Hope it’s okay for me to ask this question here. I want to know what temp you set your fridge to. Ours is set to 37F and I can never defrost frozen meat (1 lb packages) over night. In fact it doesn’t ...",
          "full_text": "Hope it’s okay for me to ask this question here. I want to know what temp you set your fridge to. Ours is set to 37F and I can never defrost frozen meat (1 lb packages) over night. In fact it doesn’t defrost even after a few days, making me think ours is set too low. We get our meat via Butcherbox and all of the meat come frozen, making meal planning a chore.",
          "score": 6,
          "comments": 7,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/j2tccn/what_is_the_ideal_temperature_for_the_refrigerator/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.751 | TextBlob: 0.300",
          "created_utc": 1601495500.0
        },
        {
          "title": "How to defrost 5 lbs bulk meat",
          "text": "Hear me out-- I know there already are a lot of posts about defrosting meat, but I can’t find anything anywhere about defrosting ***bulk*** meat.\n\nI have 5 lbs of ground venison from Force of Nature, ...",
          "full_text": "Hear me out-- I know there already are a lot of posts about defrosting meat, but I can’t find anything anywhere about defrosting ***bulk*** meat.\n\nI have 5 lbs of ground venison from Force of Nature, and I’m wondering if there is a special way to defrost bulk meat. Defrosting 1 lb of ground beef is simple—just leave it in the fridge overnight.\n\nHowever, it’s been about 18 hours, and my 5 lb cylinder of ground venison is still pretty much frozen *solid*.\n\n***How do you safely defrost bulk meat?*** I don’t care how fast or slow it takes, I just want the meat to retain quality and not go bad. Next week I am expecting a 3 lb frozen beef shoulder roast from Butcherbox, so I'm also curious how I should defrost this.\n\nThanks",
          "score": 3,
          "comments": 5,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/gow8h4/how_to_defrost_5_lbs_bulk_meat/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.985 | TextBlob: 0.055 | Positive words: ['quality'] | Negative words: ['bad']",
          "created_utc": 1590197562.0
        },
        {
          "title": "What are your thoughts on butcherbox?",
          "text": "I heard about this site on a podcast and got lured in because of a deal they had. I normally get my meat from costco, what are your thoughts? I'm still waiting for it to get delivered so I don't have ...",
          "full_text": "I heard about this site on a podcast and got lured in because of a deal they had. I normally get my meat from costco, what are your thoughts? I'm still waiting for it to get delivered so I don't have much of a opinion.",
          "score": 1,
          "comments": 5,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/f0yt2h/what_are_your_thoughts_on_butcherbox/",
          "sentiment": "positive",
          "confidence": 0.6,
          "explanation": "VADER: 0.000 | TextBlob: 0.175",
          "created_utc": 1581200551.0
        },
        {
          "title": "Never cooked pork butt. Butcherbox just sent a 6.18 lb bone-in pork butt. Not sure what to do with it.",
          "text": "The title is pretty self-explanatory. I have looked online some (and will continue to do so), but nothing has really  jumped out at me. The roasts all seem kinda bland, I'm not a big fan of pulled por...",
          "full_text": "The title is pretty self-explanatory. I have looked online some (and will continue to do so), but nothing has really  jumped out at me. The roasts all seem kinda bland, I'm not a big fan of pulled pork, and I don't have a smoker (it's basically oven or nothing).  Really, I just haven't had much experience with cooking pork other than hams, chops, or tenderloins and only chops really happen with any frequency. Thus, I don't really have a flavor profile in my head to work off of for picking a recipe out like I do with beef and chicken.  \n\n\nI'm not one to shy away from a challenge, but this isn't a small hunk of pig - it's actually probably the heaviest piece of meat I've ever been faced with the prospect of cooking - and I'm at a bit of a loss.",
          "score": 2,
          "comments": 29,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/dcjbiz/never_cooked_pork_butt_butcherbox_just_sent_a_618/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.664 | TextBlob: -0.043",
          "created_utc": 1570062755.0
        },
        {
          "title": "Is mixing cuts of beef for Boeuf Bourguignon the worst Christmas dinner mistake I'll ever make?",
          "text": "I'm making Boeuf Bourguignon for Christmas Eve dinner with some Butcher Box cuts I've already got. Problem is, I only have about 2 lbs of brisket and 2 lbs of already cut stew meat (about 1 inch cubes...",
          "full_text": "I'm making Boeuf Bourguignon for Christmas Eve dinner with some Butcher Box cuts I've already got. Problem is, I only have about 2 lbs of brisket and 2 lbs of already cut stew meat (about 1 inch cubes). \n\nI'm trying to feed 6 adults and have some leftovers, for which 2 lbs is not enough, so my first idea was to use both cuts. Is this a bad idea? The Internet concensus so far is you can use either or, but I haven't seen anyone combining them. \n\nSecond possibly bad idea is that with the whole brisket, I could cut it into bigger cubes so I have bigger pieces and not just the tiny \"cat food\" stew beef (as Julia would say). I'm thinking I could put the browned brisket in the stew first and add the smaller browned stew beef about an hour in?\n\nSave me, Reddit, from ruining Christmas for my whole family if these are terrible ideas!\n\nEdit: line breaks for clarity.",
          "score": 0,
          "comments": 11,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/1hkv5en/is_mixing_cuts_of_beef_for_boeuf_bourguignon_the/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.950 | TextBlob: -0.150 | Negative words: ['terrible', 'bad', 'worst']",
          "created_utc": 1734981582.0
        },
        {
          "title": "What are some interesting ground beef recipes?",
          "text": "I started subscribing to butcher box about a year ago and received ground beef for life as part of a promotion. I now have a lot of ground beef in my freezer at any given time.\n\nWhat are some good rec...",
          "full_text": "I started subscribing to butcher box about a year ago and received ground beef for life as part of a promotion. I now have a lot of ground beef in my freezer at any given time.\n\nWhat are some good recipes I can try out? Been getting sick of various burgers and tacos.",
          "score": 45,
          "comments": 122,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/1hislsn/what_are_some_interesting_ground_beef_recipes/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.394 | TextBlob: 0.121 | Positive words: ['good']",
          "created_utc": 1734725581.0
        },
        {
          "title": "Lazy Fish Tacos",
          "text": "Frozen fried cod nuggets (butcher box) air fried at 390 for 10 minutes.\nFinely cut lettuce and sliced tomatoes optional. I like the color and my wife says I need more veggies.\nWarm tortillas (flour or...",
          "full_text": "Frozen fried cod nuggets (butcher box) air fried at 390 for 10 minutes.\nFinely cut lettuce and sliced tomatoes optional. I like the color and my wife says I need more veggies.\nWarm tortillas (flour or corn)\nThe Sauce: stir 1:1 Duke’s mayo and chimichurri sauce with lemon juice to taste. I use Trader Joe’s chimichurri.\nStack and enjoy.",
          "score": 17,
          "comments": 15,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/1ggopsd/lazy_fish_tacos/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.507 | TextBlob: 0.333",
          "created_utc": 1730407785.0
        },
        {
          "title": "Putting together a butcher box for a college student..help!",
          "text": "Meat advice\n\nSeeking advice for a college student living in Spain. \n\nStudent has:\nAccess to a slow cooker, oven and induction stove, freezer\nCooks 6hrs/week\nHas reasonably good cooking skills\n\nSo, I h...",
          "full_text": "Meat advice\n\nSeeking advice for a college student living in Spain. \n\nStudent has:\nAccess to a slow cooker, oven and induction stove, freezer\nCooks 6hrs/week\nHas reasonably good cooking skills\n\nSo, I have come to the pros for help.\n\nCould you help me come up with a good, cheap list of things to buy at the butcher (with quantities) which will last her 3.5 weeks of 3 meals a day, where 2 meals a day require meat? My goal is to put together a butcher box of sorts for her.\n\n\nI have so far:\n\n1 chorizo (little shy of a kg)\n18 eggs\n1kg beef fillet\n5 chicken breasts boneless skinnless\n1kg cured pork jowl\n1 kg minced pork/beef mix\n1kg chicken liver\n\n\nI am wondering if the following items are worth it to buy:\n\nCow's tongue (cured or not)\nPig's ears\n\nI know this is a tall ask but need your help.",
          "score": 0,
          "comments": 1,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/190v3hc/putting_together_a_butcher_box_for_a_college/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.860 | TextBlob: -0.009 | Positive words: ['good', 'worth']",
          "created_utc": 1704642752.0
        },
        {
          "title": "Worth going to a local chicken farm?",
          "text": "I’m wondering if anyone has had experience purchasing chicken (whole or otherwise) from a local farm? I’m sure it’s more expensive then the grocery store but hoping the quality is better. \n\nAdditional...",
          "full_text": "I’m wondering if anyone has had experience purchasing chicken (whole or otherwise) from a local farm? I’m sure it’s more expensive then the grocery store but hoping the quality is better. \n\nAdditionally, any websites like butcher box or other that people have had good experiences with?",
          "score": 3,
          "comments": 14,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/16hy6qh/worth_going_to_a_local_chicken_farm/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.954 | TextBlob: 0.073 | Positive words: ['good', 'worth', 'quality']",
          "created_utc": 1694637648.0
        },
        {
          "title": "Does anyone have a favorite meat delivery service ? Was looking at force of nature and butcher box as top options to buy in bulk",
          "text": "",
          "full_text": "",
          "score": 5,
          "comments": 20,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/15a7n9m/does_anyone_have_a_favorite_meat_delivery_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.586 | TextBlob: 0.500",
          "created_utc": 1690382382.0
        },
        {
          "title": "Reheating Brisket Question",
          "text": "The Plan - serve brisket at an upcoming holiday dinner party, but I want to make it ahead of time.\n\nThe Meat - 1 pound of raw brisket per adult = 13 pounds of brisket needed. I use Butcher Box, and th...",
          "full_text": "The Plan - serve brisket at an upcoming holiday dinner party, but I want to make it ahead of time.\n\nThe Meat - 1 pound of raw brisket per adult = 13 pounds of brisket needed. I use Butcher Box, and their briskets are 2.75# each, so I will need 5 briskets but will be buying 6 briskets. \n\nThe Recipe - I plan on cooking the briskets in a slowcooker, 3 of them using a homemade BBQ sauce and 3 of them using an Apricot Bourbon sauce.\n\nMy Question - how long, and at what temperature, should I reheat the briskets in the oven before my guests arrive? Should they be covered? I'll probably heat 3 BBQ in one roasting pan and the other 3 in another roasting or baking pan.",
          "score": 0,
          "comments": 9,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/y5d5mf/reheating_brisket_question/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.544 | TextBlob: -0.076",
          "created_utc": 1665914932.0
        },
        {
          "title": "Help - I have 12lb of pork butt..",
          "text": "After 2 months of butcher box deliveries. I now have a freezer full of pork butt. I’m looking to cook it in any way that isn’t pulled/shredded pork.. \n\nSo, what would you do with that much pork? For a...",
          "full_text": "After 2 months of butcher box deliveries. I now have a freezer full of pork butt. I’m looking to cook it in any way that isn’t pulled/shredded pork.. \n\nSo, what would you do with that much pork? For a family of 2.5..",
          "score": 0,
          "comments": 23,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/sg1op1/help_i_have_12lb_of_pork_butt/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.402 | TextBlob: 0.275",
          "created_utc": 1643520010.0
        },
        {
          "title": "Organic ground chicken with weird taste and smell, within sell by date!?",
          "text": "I used to love making chicken meatballs &amp; patties but lately every time I make anything with ground chicken it ends up with a weird smell (like wet dog) and off taste. \n\nI buy only organic from ei...",
          "full_text": "I used to love making chicken meatballs &amp; patties but lately every time I make anything with ground chicken it ends up with a weird smell (like wet dog) and off taste. \n\nI buy only organic from either Trader Joe’s or Butcher Box, and it’s always within the sell by date and looks and and feels fine. Not rancid or slimey.. color looks fine. \n\nI’m so sad to waste food, and so frustrated that this keeps happening.. anyone else also having this experience? Anyone know why this happens with ground chicken? \n\nThanks!",
          "score": 2,
          "comments": 9,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/rkaqe6/organic_ground_chicken_with_weird_taste_and_smell/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.524 | TextBlob: -0.234 | Positive words: ['love'] | Negative words: ['waste']",
          "created_utc": 1639962216.0
        },
        {
          "title": "Cooking a brisket without a smoker",
          "text": "I accidentally let Butcher Box ship me a repeat of my last box without editing. In my previous box, I thought I’d give brisket a try. It was a complete disaster—I popped in the slow cooker in some bro...",
          "full_text": "I accidentally let Butcher Box ship me a repeat of my last box without editing. In my previous box, I thought I’d give brisket a try. It was a complete disaster—I popped in the slow cooker in some broth with some herbs. It was so tough, dry and flavorless.\nAnd yet here I am now with another 2.75 lb brisket, no grill, smoker, sous vide or instapot and no idea how to cook it. Help!!",
          "score": 2,
          "comments": 10,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/rjx9kr/cooking_a_brisket_without_a_smoker/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.688 | TextBlob: -0.143",
          "created_utc": 1639922283.0
        },
        {
          "title": "My dad's perfectly boiled White Cut Chicken (白切鸡) &amp; Ginger Scallion Sauce (姜葱酱)! AKA Poached Whole Chicken or Bak Chit Gai, it's a simple, traditional, and almost-required dish for Lunar New Year, tied with many auspicious sayings and superstitions.",
          "text": "There's a saying in Chinese that goes something like, \"No chicken, no banquet.\" This dish is steeped in tradition and good luck, and I'm extremely grateful to get to document how my dad does it and to...",
          "full_text": "There's a saying in Chinese that goes something like, \"No chicken, no banquet.\" This dish is steeped in tradition and good luck, and I'm extremely grateful to get to document how my dad does it and to share it with our community :) \n\nThis post will cover:\n\n* How to boil the perfect, juicy **White Cut Chicken**\n* How to make my dad’s addictive **Ginger Scallion sauce**\n* The traditional Chinese way to **carve and plate a chicken** from head to toe\n* The various Chinese idioms / meanings tied to whole chicken\n\nHere are a few pictures of [what the recipes look like](https://imgur.com/a/RpP2hQH) if you want a visual :)\n\n# Superstition: Chicken\n\nIn Chinese tradition, chicken is intertwined with many sayings and superstitions of good fortune, wealth, and resilience.\n\nEven though my parents didn't have much meat growing up in China, this is one of the dishes my parents always ate on Lunar New Year's eve and other festivities.\n\nEspecially with auspicious foods, Chinese superstition involves a lot of creative word-play. The word for chicken, gāi in Cantonese and jī in Mandarin, sounds like several words of good fortune.\n\nJust to name a few phrases that my parents shared with us:\n\n* hóu sai gaai 好世界 - A Cantonese phrase that roughly translates to good world, good life.\n* dàjídàlì 大吉大利 - A Mandarin phrase that roughly translates to great luck, great profit.\n* yáuh tàuh yáuh méih 有头有尾 - A Cantonese phrase that literally translates to: \"has a head, has a tail.\" It means \"good beginning, good ending.\" This is one of the reasons why it's important to make a whole chicken for Lunar New Year.\n* jáau pàh jáau wàh 抓扒抓鏵 - A Toisanese phrase, related to eating the chicken legs, that roughly means \"face all challenges with persistence.\"\n\nSo, basically, eat a whole chicken if you want to live. (jk)\n\n## Using a Proper Knife\n\nThe most intricate part of this recipe is the last step, where we carve up the chicken into pieces we can easily grab with a chopstick.\n\nMy dad has two knives - a \"chef's knife\", meant for vegetables and boneless meats, and a heavy duty cleaver, meant for occasions like this.\n\nIt's a lot harder to do this without a proper cleaver, so here are a few options you can look up:\n\n* Dexter Russell Heavy Duty Cleaver\n* [The same brand (not same model) as my dad's 40 year-old cleaver](https://item.taobao.com/item.htm?ut_sk=1.XR79XxYXt6sDAC8yCxOJl3U5_21380790_1609898344895.Copy.1&amp;id=630231282048&amp;detailSharePosition=interactBar&amp;sourceType=item&amp;suid=6C603E4D-6164-4DA8-8C61-790B2DE81EE4&amp;shareUniqueId=6881406817&amp;un=5fbdcd42b3253757dfb454b3d994b7d3&amp;share_crt_v=1&amp;spm=a2159r.13376460.0.0&amp;sp_tk=dThBVGNzQld2OWY=&amp;cpp=1&amp;shareurl=true&amp;short_name=h.4S1KiFP&amp;bxsign=scdfCTl7pW2s3tCpp7nnG1tdxUFrtYdbbyIT60TmslnzN4-9ZCBvFh4ynYYvYfyQWF2AOvFNA2Xinbs5tp8w4mgHthhB2LS4_4Gbo7_S0r1O7U&amp;sm=ddd6d0&amp;app=chrome) (ships from China)\n\nIf you don't have one, you can also try cutting at the various joints, which my dad didn't demonstrate but said is possible.\n\nYou'll also want a thick wooden cutting board which helps absorb the impact of forceful chopping.\n\nIf you're not familiar with Chinese knives, check out my [previous post on the basics](https://www.reddit.com/r/Cooking/comments/kr7bsq/basic_chinese_knife_skills_101_%E4%B8%AD%E5%9B%BD%E5%88%80%E6%8A%80%E5%B7%A7_i_sat_down/).\n\n## Choosing a Chicken\n\nIf you're making this for Lunar New Year and following Chinese tradition, you'll need to buy a chicken that has its head, feet, toes, etc. intact.\n\nThe two main types that my dad uses are \"Yellow Hair Chicken\" and \"Kwai Fei Chicken\".\n\n* Yellow Hair Chicken tends to have more chewy meat. Many Chinese people prefer this.\n* Kwai Fei Chicken tends to have a larger quantity of meat on it, with thicker meat that's more tender.\n\nFor this specific recipe, my dad got hooked up by his old restaurant with their wholesale pricing, but you can usually buy these at an Asian grocery store or market.\n\nIf you don't have access to an Asian grocery store, you can just buy as fresh and whole of a chicken as you can get, and try to stick to a chicken that's around 4 pounds so it cooks more evenly in the pot.\n\nThe fresher the chicken, the better. And, if you can, buy it sustainably.\n\n## Sourcing Chicken Sustainably\n\nThe most environmentally friendly (and freshest) way to source chicken is to raise your own, just like my parents did back in the day.\n\nObviously, that’s not easy for most of us, so some options would be to shop with a local farm or butcher, or to buy Animal Welfare Certified chicken.\n\nAmongst the strongest seals of approvals is the **Animal Welfare Certified** label from the Global Animal Partnership, a non profit originally created by Whole Foods Market in 2008.\n\nThis is one of only 3 food certification labels endorsed by the ASPCA, one of the oldest and largest humane societies in the world, the others being “**Certified Humane**” and “**Animal Welfare Approved**.” Although they’re not as widespread, they set much higher standards than the more common USDA Organic certifications.\n\nIf you live in the US and feel inclined to support these causes, you can look for GAP certified meat at Whole Foods, or through Butcher Box, a popular meat delivery subscription service that sources their meats in line with all of the highest standards that we’ve touched on.\n\n## The Recipe\n\nMain Ingredients\n\n* 4 lb **whole chicken** (traditionally for Lunar New Year, the chicken has its head &amp; feet intact)\n* 2 oz **green onion**\n* 1.5 oz **ginger**\n* 5 tbsp **corn oil**\n\nAdditional Flavor &amp; Seasoning\n\n* 1 tsp **salt** (for boiling water)\n* 2 tsp **salt** (for ginger scallion sauce)\n* 1 tbsp **sesame oil**\n\n# Step 1 - Boil water, add salt\n\nSet the stove to high heat and start boiling a generous amount of water in the pot you'll be using.\n\nWe'll want to be able to fully submerge our chicken in the water to make sure it cooks evenly.\n\nWe'll also be adding **1 teaspoon of salt**. My dad says not to add too much here.\n\n# Step 2 - Prepare &amp; cook chicken\n\nWait for the water to come to a boil.\n\nWe'll be doing a couple of things in this step, mostly to ensure that the entire chicken is cooked evenly for maximum tenderness.\n\n* **Pierce a hole in the skin in the neck -** This helps the water flow through the chicken cavity to help it cook more evenly.\n* **Stretch the legs away from the body several times -** This helps to avoid having a big clump of chicken meat that's undercooked.\n* **Slowly dip the chicken 3 times in the boiling water -** This helps even out the temperatures on the inside of the cavity and on the exterior of the chicken. Make sure the water is already boiling before you do this.\n* **Add the chicken and make sure it's completely submerged -** If you have to add more boiling water, do it.\n\nFrom here, we'll cover the pot.\n\nHere's a rough heat / timing overview:\n\n* Once the pot's been covered, leave it on high heat for 5 minutes as the water comes to a boil again.\n* Lower the heat to a simmer, and cook for another 35-40 minutes. The larger the chicken, the longer you cook it. The sweet spot is 4 pounds.\n* Check if it's done. If so, transfer it to an ice bath. (More on both of these later.)\n\n# Step 3 - Mince scallions and ginger\n\nWhile we wait for the chicken to cook, we'll start on our sauce by mincing our **green onions** (2 oz) and **ginger** (1.5 oz)​.\n\nMy dad said the exact ratio and amounts don't matter too much. Most recipes I've seen use more scallions than ginger.\n\nHaving a surplus of sauce is a great problem to have, since you can use it on pretty much everything. (I LOVE dousing my rice and vegetables in this addictive sauce)\n\nFor the green onions, we'll be using the white stems (about 4 stems at the default serving size). Cut each stem in half, length-wise, and then into strips. Then, mince the strips into fine pieces.\n\nFor the ginger, we'll be cutting them into thin slices, strips, and then fine pieces.\n\nMy dad is using separate plates to hold the green onions and ginger. The ginger will be cooked first in the next step, so this makes it easier to separate.\n\nAlso, feel free to use a food processor here instead of mincing.\n\n# Step 4 - Heat oil, cook ginger scallions\n\nWe'll heat up our wok on high heat and add **corn oil** (5 tbsp).\n\nThe oil should be around 350-400F before we add the ginger.\n\nA good visual cue is to wait until the oil starts \"shimmering\", or forming ripples across the surface due to the heat.\n\nWhy do we do this? By cooking everything in oil, we unlock the aromatics of the ginger and green onion.\n\nOnce the oil is hot enough, add the ginger and cook for about 15 seconds before adding the green onions. Cook everything for another 20-30 seconds before transferring the sauce to a bowl.\n\n# Step 5 - Flavor the sauce\n\nWe'll add **salt** (2 tsp) and **sesame oil** (1 tbsp) to the bowl, and mix for 30-60 seconds.\n\nDo a taste test and adjust if necessary. My dad emphasized multiple times how important it is to add sesame oil here, so make sure you don't skip it.\n\n# Step 6 - Prepare an ice bath\n\nGrab a big bowl and dump a few handfuls of ice into it. Fill it roughly halfway with cold water.\n\nThe ice bath is very important - once the chicken is done cooking, we need to immediately cool it down.\n\nWhy is this so important?\n\n* **It helps the meat contract and locks the juices inside - I**f we skip this step, juices will flood out as we chop the chicken into pieces.\n* **It helps the skin stay attached -** Without this step, we'll have a bunch of loose pieces of skin everywhere.\n* **It gives the skin a bit more of a chewy texture**\n\n# Step 7 - Determine if the chicken is done\n\nOnce the time draws near, we can uncover the pot. Poke the thickest part of the chicken (around the thigh) deeply with a chopstick.\n\nIf blood or red fluid leaks out, we need to cook it for a few more minutes.\n\nIf the fluid is clear, it's ready for the ice bath.\n\nFeel free to use your newfound chicken broth however you'd like. In the video, my dad created two additional dishes (a soup and a veggie) out of it by boiling bok choy with some ginger.\n\n# Step 8 - Lift and transfer to ice bath\n\nCarefully take two chopsticks under the chicken wings, and lift it over the pot.\n\nSuspend it over the pot for 30-45 seconds to let some of the residual water drip out.\n\nThen, carefully transfer it into the ice bath. Prepare for a splash!\n\nLet the chicken sit in the bath for 5 minutes, occasionally pouring water over the surface of the chicken and rotating the chicken in the container.\n\n# Step 9 - Carve the chicken\n\nThis could honestly be its own post, but for now it will live in a very detailed step in this recipe.\n\nThis is a lot easier to follow in our video, where we dedicate about 6 minutes of time to this segment.\n\nThere are a few things to keep in mind before you start.\n\n* My dad’s done this hundreds of times, and it took him about 10 minutes from start to finish. It’ll probably take a lot longer if you’re a beginner like me, but the main thing is just to make sure your cleaver is sharp and that you’re moving carefully and deliberately. \n* If you don’t already have a cleaver, it’s still technically possible, but I highly recommend getting one if you plan on making this dish.\n* For easier, safer cutting, you should use a larger, thicker cutting board that’s preferably made of wood, and you should place a moist towel underneath it to increase its stability.\n\nHow to plate, according to Chinese tradition:\n\n* Basically everything is plated - even parts that aren't readily edible like the head.\n* Each piece of chicken is laid out on a large plate according to where it was on its body, head to toe, right to left.\n* You'll often see this served on a large oval-shaped plate.\n\nOrder of operations:\n\n* Cut off the neck and feet, cut into small pieces\n* Cut and place the head and butt at opposite ends of the middle axis of the plate\n* Remove the wings and thighs\n* Cut and split the torso into two halves (front and back)\n* Split the back in half, and cut it into pieces\n* Cut and pry away the breast bone, and cut it into pieces\n* Cut the thighs and wings into small pieces\n\nCutting techniques:\n\n* A technique my dad uses a lot involves making a shallow slice to wedge the cleaver, and then hitting down on the blade with our palm to drive the blade through the bone. \n* In our recent knife skills interview, my dad talked about the 3 different parts of the blade - the root, the belly, and the tip. When chopping through bone, he always makes contact with the root, or the part of the blade closest to the handle. \n\nWhen I first started this project, documenting how my dad carves a chicken was high on the list of traditions I wanted to learn and share. It always feels like I’m watching an artist at work when I see my dad gracefully chop and plate everything. \n\nEvery cut has an intention, and every piece has a place. Almost everything goes on the plate, and nothing is wasted. Especially for Lunar New Year and other celebrations, bak chit gai is meant to be one of the main decorative centerpieces on the dinner table, and carving it up into beautiful bite-sized pieces is an honor that I hope to take on one day for my own family. \n\n# Our why\n\nI've always wanted to honor my parents and capture the hundreds of recipes that my dad's perfected over 50 years as a Chinese chef. I want to celebrate their legacy and epic journey of making something of themselves here in America, and pass it down to our kids.\n\nThanks for reading! Hope you all love the recipes :)",
          "score": 2142,
          "comments": 184,
          "subreddit": "cooking",
          "url": "https://reddit.com/r/Cooking/comments/l0zkw2/my_dads_perfectly_boiled_white_cut_chicken_白切鸡/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 1.000 | TextBlob: 0.009 | Positive words: ['love', 'great', 'good', 'recommend', 'fresh', 'easy'] | Negative words: ['waste']",
          "created_utc": 1611109645.0
        }
      ]
    },
    "Home Chef": {
      "total_posts": 20,
      "positive": 18,
      "negative": 1,
      "neutral": 1,
      "real_posts": [
        {
          "title": "Other Meal Kits",
          "text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc...",
          "full_text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc) ",
          "score": 7,
          "comments": 15,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
          "created_utc": 1760059421.0
        },
        {
          "title": "nyone switch from HelloFresh to Marley Spoon or Home Chef? Looking for real experiences",
          "text": "I think I’ve finally had enough of HelloFresh. The bags are always ripped, I’m constantly piecing ingredients together, and missing items only ever get me a tiny $3 credit. Worst of all, the cold pack...",
          "full_text": "I think I’ve finally had enough of HelloFresh. The bags are always ripped, I’m constantly piecing ingredients together, and missing items only ever get me a tiny $3 credit. Worst of all, the cold packs are always, without exception, busted, leaking all over the food and our floor.\n\nI’ve given them so many chances, but I’m ready to move on. Has anyone here tried Marley Spoon or Home Chef? Would love to hear if either of them is a better experience.",
          "score": 2,
          "comments": 22,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1nusayf/nyone_switch_from_hellofresh_to_marley_spoon_or/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.925 | TextBlob: 0.008 | Positive words: ['love', 'fresh'] | Negative words: ['worst']",
          "created_utc": 1759273953.0
        },
        {
          "title": "Chicken Pita Pockets/Green Goddess Salad",
          "text": "I’ve been lurking here a while - I have been a long time user of HelloFresh (and Home Chef before that). \n\nI am trying to cook more again, so I am hoping that posting photos will kick me in the ass to...",
          "full_text": "I’ve been lurking here a while - I have been a long time user of HelloFresh (and Home Chef before that). \n\nI am trying to cook more again, so I am hoping that posting photos will kick me in the ass to cook more, and maybe eventually be like some of the other people who can actually meal prep and not need HF to bail me out!\n\nOriginally, I ordered three meals - I’d have one and save one (or my kid would like the smell and devour it). Now my girlfriend and her daughter live with me, so I make four servings for each meal (or four servings for all, and then two servings for a lunch). \n\nThis was simple and easy - reheating the pita the next day (unassembled) with a damp towel made it work. And I found doing lettuce THEN chicken was a better handling/flavor experience. \n\nLove seeing all your posts and tips and tricks!",
          "score": 19,
          "comments": 4,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1mdc77n/chicken_pita_pocketsgreen_goddess_salad/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.861 | TextBlob: 0.121 | Positive words: ['love', 'fresh', 'easy']",
          "created_utc": 1753895165.0
        },
        {
          "title": "HelloFresh alternatives that let you view upcoming menus before charging your CC?",
          "text": "Have been a HF subscriber for years, but looking into alternatives (mainly bc I’ve become bored with repeated recipes &amp; almost everything that peaks my interest has some sort of an up charge now)....",
          "full_text": "Have been a HF subscriber for years, but looking into alternatives (mainly bc I’ve become bored with repeated recipes &amp; almost everything that peaks my interest has some sort of an up charge now).\n\nWas previously a MarleySpoon subscriber, but saw a significant decrease in ingredients quality, so moved back to HF.\n\nI get free meals from my work through Factor that I opt out of bc I physically cannot stomach them (I think they’re awful) &amp; I don’t want to waste food. \n\nWas leaning towards HomeChef, but they want my CC details to charge before I can even view upcoming weeks menus.\n\nHoping for some suggestions 🙏",
          "score": 0,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1lcvxbd/hellofresh_alternatives_that_let_you_view/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.710 | TextBlob: -0.103 | Positive words: ['fresh', 'quality'] | Negative words: ['awful', 'waste']",
          "created_utc": 1750087940.0
        },
        {
          "title": "Hello Fresh or Home Chef",
          "text": "Getting tired of Marley Spoon..too much busy work…LEMON. ZEST is standard in every recipe. I have used both of the above but which do you think is the best currently. We like good fresh food…thanks in...",
          "full_text": "Getting tired of Marley Spoon..too much busy work…LEMON. ZEST is standard in every recipe. I have used both of the above but which do you think is the best currently. We like good fresh food…thanks in advance ",
          "score": 12,
          "comments": 40,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1kzglf4/hello_fresh_or_home_chef/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.948 | TextBlob: 0.222 | Positive words: ['good', 'fresh']",
          "created_utc": 1748641935.0
        },
        {
          "title": "Blocked from Hello Fresh?!",
          "text": "Anyone else randomly get blocked from Hello Fresh’s website?! We’ve been using HomeChef for over a year now and was thinking about switching, but now I can’t even get on the site lol guess not",
          "full_text": "Anyone else randomly get blocked from Hello Fresh’s website?! We’ve been using HomeChef for over a year now and was thinking about switching, but now I can’t even get on the site lol guess not",
          "score": 1,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1km2eos/blocked_from_hello_fresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.636 | TextBlob: 0.263 | Positive words: ['fresh']",
          "created_utc": 1747183835.0
        },
        {
          "title": "Working on a project from hello fresh and need some input.",
          "text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other comp...",
          "full_text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other companies like Blue Apron, Green Chief, Hungry Root, Sunbasket, Home Chef, etc. ?",
          "score": 0,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
          "created_utc": 1744158624.0
        },
        {
          "title": "HORRIBLE customer service",
          "text": "After a year with HelloFresh, they ‘accidentally’ reset all my earned rewards—including 10% off and free delivery—costing me over $1,000 in yearly discounts. Customer service was unhelpful in resolvin...",
          "full_text": "After a year with HelloFresh, they ‘accidentally’ reset all my earned rewards—including 10% off and free delivery—costing me over $1,000 in yearly discounts. Customer service was unhelpful in resolving it. If you’re considering a meal kit, go with Home Chef instead. Three of the four reps had no idea what HelloFesh+ or box streaks are and were zero help. After an hour, I finally got connected with a supervisor and he said “Hi, my name is Jodi” then disconnected the call. Absolute nightmare.",
          "score": 0,
          "comments": 8,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1ifdd3y/horrible_customer_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.288 | TextBlob: -0.100 | Positive words: ['fresh', 'helpful'] | Negative words: ['horrible']",
          "created_utc": 1738436000.0
        },
        {
          "title": "Switching to Home Chef?",
          "text": "Think about leaving Hf for HC.  Pros/Cons?",
          "full_text": "Think about leaving Hf for HC.  Pros/Cons?",
          "score": 2,
          "comments": 13,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1giqzms/switching_to_home_chef/",
          "sentiment": "neutral",
          "confidence": 0.7,
          "explanation": "VADER: 0.000 | TextBlob: 0.000",
          "created_utc": 1730651856.0
        },
        {
          "title": "Hellofresh vs homechef",
          "text": "I recently joined home chef and was curious about how it compares to hellofresh. \n\nI've only had homechef for one week and so far am mostly satisfied with the portions (i like bigger protions), custom...",
          "full_text": "I recently joined home chef and was curious about how it compares to hellofresh. \n\nI've only had homechef for one week and so far am mostly satisfied with the portions (i like bigger protions), customer service, and price.\n\n How is hellofresh in these areas? If you've tried both services, which do you prefer and why?\n\nThanks!",
          "score": 3,
          "comments": 7,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1f1dx4b/hellofresh_vs_homechef/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.879 | TextBlob: 0.107 | Positive words: ['fresh', 'satisfied']",
          "created_utc": 1724640518.0
        },
        {
          "title": "Well mouldy food is the end for me",
          "text": "After 3 years of an on and off use of hello fresh I'm just going to call it quits.  It definitely spurred me onto become more of a home chef, but the whole game of will I actually get the correct ingr...",
          "full_text": "After 3 years of an on and off use of hello fresh I'm just going to call it quits.  It definitely spurred me onto become more of a home chef, but the whole game of will I actually get the correct ingredients and will they be fresh has ruined the experience.",
          "score": 4,
          "comments": 1,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1eineye/well_mouldy_food_is_the_end_for_me/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.214 | TextBlob: 0.129 | Positive words: ['fresh']",
          "created_utc": 1722638290.0
        },
        {
          "title": "Meat Quality (tough chicken breasts)",
          "text": "How has the quality of the meat been? I used to order years ago but I quit because the quality of the chicken breasts was so bad, the chicken was tough and I couldn’t even eat it so I switched to Home...",
          "full_text": "How has the quality of the meat been? I used to order years ago but I quit because the quality of the chicken breasts was so bad, the chicken was tough and I couldn’t even eat it so I switched to Home Chef. Has it improved?\n",
          "score": 4,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1dwo78o/meat_quality_tough_chicken_breasts/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.665 | TextBlob: -0.546 | Positive words: ['quality'] | Negative words: ['bad']",
          "created_utc": 1720268004.0
        },
        {
          "title": "Introductory offer?",
          "text": "I just got my first box this week. I loved last night's meal and found it very similar to Home Chef, except with fewer plastic bags. I'm wondering how they work these \"introductory offers,\" though. Su...",
          "full_text": "I just got my first box this week. I loved last night's meal and found it very similar to Home Chef, except with fewer plastic bags. I'm wondering how they work these \"introductory offers,\" though. Supposedly I was supposed to get something like 10 free meals, but it looks like they're \"discounting\" each meal to a ridiculous extent (8 to 13 percent) each week. Is this typical? So I'd eventually get a free meal over the course of many months?",
          "score": 5,
          "comments": 6,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1dqns39/introductory_offer/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.945 | TextBlob: 0.185 | Positive words: ['love']",
          "created_utc": 1719592044.0
        },
        {
          "title": "Marley Spoon Comparison",
          "text": "I’m doing MS while I take a break to get some discount codes on HF and Home Chef. Now, I love HF but I’m seeing a big difference already. I first pulled out the one garlic clove and didn’t give it a s...",
          "full_text": "I’m doing MS while I take a break to get some discount codes on HF and Home Chef. Now, I love HF but I’m seeing a big difference already. I first pulled out the one garlic clove and didn’t give it a second thought and then I saw the rest of the WHOLE head! And look- an actual onion instead of scallions and real, decent sized russets instead of teeny tiny taters! I don’t love that all the ingredients are in one bag, but other than that, everything looks good. Definitely much larger bag of green beans and spinach too. Just an observation, still will rotate through all 3 as long as I can keep myself organized enough to keep them all from coming in the same week. Lol ",
          "score": 9,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1cmn0i3/marley_spoon_comparison/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.969 | TextBlob: 0.169 | Positive words: ['love', 'good']",
          "created_utc": 1715116726.0
        },
        {
          "title": "Better promotion?",
          "text": "\nI'm looking at trying HelloFresh. I've had HomeChef before and really liked it but it got expensive quickly after the promo ended. I always did the Oven Ready ones which didn't really involve much pr...",
          "full_text": "\nI'm looking at trying HelloFresh. I've had HomeChef before and really liked it but it got expensive quickly after the promo ended. I always did the Oven Ready ones which didn't really involve much prep time and were easy. First, does HelloFresh offer easy options like that too? \n\nFor promotions, I've seen a few options:\n\n1 - $120 off (not sure if this is one order or stretched out or what)\n2 - 16 meals free and free dessert for life (not sure how the 16 are stretched out)\n3 - $45 off and free shipping on 1st box, $15 off of 2nd through 4th boxes + 3 free gifts\n\nI can't find pricing to know how these would weigh out against each other. I'm just looking for the best way to give it a shot. Any help is appreciated.",
          "score": 1,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1b2p4rf/better_promotion/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.994 | TextBlob: 0.197 | Positive words: ['fresh', 'easy']",
          "created_utc": 1709173879.0
        },
        {
          "title": "Other meal kits you prefer?",
          "text": "Whether or not you're happy with HF (I'm kinda over them, TBH), what other similar meal kit services have you tried? What are their pros/cons?\n\nI've also tried:\n\n**Home Chef** \\- for a while I was rot...",
          "full_text": "Whether or not you're happy with HF (I'm kinda over them, TBH), what other similar meal kit services have you tried? What are their pros/cons?\n\nI've also tried:\n\n**Home Chef** \\- for a while I was rotating between them and HF. HC provides several simpler meal options, give you an idea of a meal's shelf life in order to assist prioritizing which meals to make first, provide single-use baking trays, but use a lot more plastic in packaging.\n\n**Factor\\_** \\- (apparently also owned by HF) tried them for one week. Was not impressed. For the same price as a 3-meal 2-serving shipment, you get three single-serving microwave meals. High quality, sure, and requiring minimal if no prep, but how much would you pay for a microwave meal?\n\n**Marley Spoon** \\- I'm in a trial period, and... so far, I'm a fan! (disclaimer: not an employee nor a paid sponsor) Would never stay on and pay full price, but whenever I get another offer, I'll give them another shot. I like their packaging. They have a cardboard tray with all the meals' ingredients (except the meats) plus a single ice pack, cutting down on packaging. They offer three tiers of meals, a standard selection and premium selection, but also offer a more basic selection at a reduced price, which is different. The meal portions are larger. Even when the meats are still usually 10oz portions, the other ingredients flesh it out more. One meal is two hearty servings, where with HC and HF it felt like either too much if I ate it all or not enough if I divided it into two meals. Only quibble is that both times I've had delivery issues.\n\nWhat other meal services have you used and what has been your reaction?",
          "score": 24,
          "comments": 14,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1amxs35/other_meal_kits_you_prefer/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.553 | TextBlob: 0.063 | Positive words: ['quality', 'happy'] | Negative words: ['issues']",
          "created_utc": 1707510516.0
        },
        {
          "title": "Thinking about trying a different meal service",
          "text": "I’ve skipped a few weeks during the holiday season and I’m thinking about trying other options rather then go back to Hello Fresh, like Blue Apron or Home Chef. Has anyone made the switch but then com...",
          "full_text": "I’ve skipped a few weeks during the holiday season and I’m thinking about trying other options rather then go back to Hello Fresh, like Blue Apron or Home Chef. Has anyone made the switch but then come back to Hello Fresh?  If you have, which one did you switch to and why did you come back?  I currently do the four person plan, twice a week. Thank you!",
          "score": 6,
          "comments": 10,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/18nzo27/thinking_about_trying_a_different_meal_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.878 | TextBlob: 0.027 | Positive words: ['fresh']",
          "created_utc": 1703199004.0
        },
        {
          "title": "Delivery via Fareye",
          "text": "I’m getting my first Hello Fresh order this week, and I see the courier is something called Fareye.\n\nI’ve never heard of them before, and all I can find on them is that they’re a “last mile” delivery ...",
          "full_text": "I’m getting my first Hello Fresh order this week, and I see the courier is something called Fareye.\n\nI’ve never heard of them before, and all I can find on them is that they’re a “last mile” delivery service with pretty much everything I see focused on shippers not recipients. \n\nI’m a little concerned because my apartment complex can be very confusing. I’ve asked the package be left in some lockers in the complex, but I’m not sure if they’d have access to them, or know how to use them.\n\nCan anyone share experiences with them, good or bad? I’vee just switched to Hello Fresh from Home Chef, which uses FedEx and my shipping experience was usually good.",
          "score": 2,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/18hi2vf/delivery_via_fareye/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.849 | TextBlob: 0.038 | Positive words: ['good', 'fresh'] | Negative words: ['bad']",
          "created_utc": 1702477917.0
        },
        {
          "title": "First time trying hello fresh",
          "text": "For loyal buyers , how does hello fresh pair up with other meal kits? I’ve tried home chef and a local one in my city that’s a take on popular meal kits. I see that there is a cyber Monday sale going ...",
          "full_text": "For loyal buyers , how does hello fresh pair up with other meal kits? I’ve tried home chef and a local one in my city that’s a take on popular meal kits. I see that there is a cyber Monday sale going on and was wondering if it’s even worth it.",
          "score": 5,
          "comments": 14,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/185cdna/first_time_trying_hello_fresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.886 | TextBlob: 0.245 | Positive words: ['fresh', 'worth']",
          "created_utc": 1701115981.0
        },
        {
          "title": "Questions before I switch to Hello Fresh",
          "text": "\nDue to repeated issues with our orders, we’re considering dropping Home Chef in favor of Hello Fresh.\n\nA few questions we have:\n\n* Does Hello Fresh offer something like the Home Chef oven ready meals...",
          "full_text": "\nDue to repeated issues with our orders, we’re considering dropping Home Chef in favor of Hello Fresh.\n\nA few questions we have:\n\n* Does Hello Fresh offer something like the Home Chef oven ready meals that are very simple to cook, that basically require putting the ingredients in a pan and baking? We like those because I can make those despite not being much of a cook, and my husband can handle the more difficult ones.\n* Failing something like that, are there other simple meal options? \n* Does Hello Fresh allow protein substitutions? That’s a big factor for us as we try to avoid red meat.\n* What delivery service do they use?",
          "score": 5,
          "comments": 34,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/17veq60/questions_before_i_switch_to_hello_fresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.925 | TextBlob: 0.077 | Positive words: ['fresh'] | Negative words: ['issues']",
          "created_utc": 1700002342.0
        }
      ]
    },
    "Blue Apron": {
      "total_posts": 20,
      "positive": 19,
      "negative": 0,
      "neutral": 1,
      "real_posts": [
        {
          "title": "Other Meal Kits",
          "text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc...",
          "full_text": "Hey all, currently I am using Hello Fresh and I have nothing to complain about.  I am just wondering if anyone else has had any experience with other products similar to HF? (Blue apron, Home Chef etc) ",
          "score": 7,
          "comments": 15,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
          "created_utc": 1760059421.0
        },
        {
          "title": "Recreate Dishes",
          "text": "How often do you all recreate dishes? I used Blue Apron and Marley Spoon. Blue apron - I recreate the dishes constantly, simple and easy to source ingredients. Unique flavors, low carbs. Marley Spoon ...",
          "full_text": "How often do you all recreate dishes? I used Blue Apron and Marley Spoon. Blue apron - I recreate the dishes constantly, simple and easy to source ingredients. Unique flavors, low carbs. Marley Spoon uses unique spice sauces/spices that it has been way more difficult to recreate. How is Hello Fresh lately? Do you recreate a lot of dishes. \n\nBonus - what is your favorite dish to recreate? ",
          "score": 2,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1nc80nk/recreate_dishes/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.810 | TextBlob: 0.140 | Positive words: ['fresh', 'easy']",
          "created_utc": 1757387269.0
        },
        {
          "title": "Blue Apron is doing too much.",
          "text": "I can’t. These prep times and instructions etc. I miss Hello Fresh. ",
          "full_text": "I can’t. These prep times and instructions etc. I miss Hello Fresh. ",
          "score": 46,
          "comments": 28,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1misdaz/blue_apron_is_doing_too_much/",
          "sentiment": "positive",
          "confidence": 0.6,
          "explanation": "VADER: 0.178 | TextBlob: 0.167 | Positive words: ['fresh']",
          "created_utc": 1754446013.0
        },
        {
          "title": "Canceling HelloFresh after two years",
          "text": "I have debated writing this post, knowing it won’t do much but today was the last straw and I’m tired of taking it out on the hardworking customer service reps. HelloFresh changed my life and eating h...",
          "full_text": "I have debated writing this post, knowing it won’t do much but today was the last straw and I’m tired of taking it out on the hardworking customer service reps. HelloFresh changed my life and eating habits so this is really disappointing, but I can’t keep justifying throwing $90 out the door every week. \n\nHelloFresh has significantly declined in quality the last year. I don’t know if there was a change in leadership or ownership but regardless, I am appalled at how quickly the ingredients and service and customer experience degraded. And there has been 0 effort to right the wrongs.\n\n- my box this week has not been delivered, no updates on the status until I called. Only to find out it might not be delivered at all. Instead I’m offered $15 in credits which does NOTHING to help the fact I have 0 meals for this week \n\n- my ingredients have routinely showed up moldy and rotting (ingredients like an onion, which take forever to go bad - how long was it sitting there) or the ingredients come water damaged or with freezer burn (zucchinis, carrots etc)\n\n- last week I was really excited to make a pasta only to find the cream sauce base exploded everywhere, therefore I could not make my pasta without it\n\n- during black history month I selected all my meals, and I was particularly excited about the bbq chicken and mac n cheese. That week I open the app only to find all my meal selections have been RESET. Nothing I chose was ordered. I furiously call and try to right this before the box ships out. I speak to someone who helps me fix my selections yet when my box shows up next week my meals are STILL WRONG. \n\n- don’t even bother ordering the 15min easy prep single pan meals unless you want mushy goo that tastes like olive garden\n\n- I noticed on the recipe cards they changed all the previous terminology “olive oil” with “cooking oil” and this is the biggest indicator and confirmation to me that the quality has declined, HelloFresh is cheap  and trying to appeal to a lower income customer. \n\nPEACE YALLLL see you blue aprons site ",
          "score": 154,
          "comments": 105,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1k4pa4i/canceling_hellofresh_after_two_years/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.901 | TextBlob: -0.062 | Positive words: ['fresh', 'quality', 'easy'] | Negative words: ['bad']",
          "created_utc": 1745271098.0
        },
        {
          "title": "Working on a project from hello fresh and need some input.",
          "text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other comp...",
          "full_text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other companies like Blue Apron, Green Chief, Hungry Root, Sunbasket, Home Chef, etc. ?",
          "score": 0,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
          "created_utc": 1744158624.0
        },
        {
          "title": "Blue Apron v. Hello Fresh",
          "text": "I’m posting this comparison in both Blue Apron and Hello Fresh subs. I get both meal kits delivered alternating weeks and have used the services for three months. Hello Fresh (HF) delivers to me on Sa...",
          "full_text": "I’m posting this comparison in both Blue Apron and Hello Fresh subs. I get both meal kits delivered alternating weeks and have used the services for three months. Hello Fresh (HF) delivers to me on Saturday, and Blue Apron (BA) on Friday.  I enjoy both and will continue to get both because they have different strengths. I am single and order two meals per week, and they last for a minimum of four dinners.\n\nTLDR:\n\nSingle? Blue Apron or both, like me!\n\nFamily?  Hello Fresh  \n\n**Overall Winner: Hello Fresh** \n\n**Recipe Quality**\n\nFresh meats and veggies from both.\n\nHF offers more family-friendly foods with the same base: chicken, pork, potato wedges, mashed potatoes, and broccoli.\n\nBA offers much fancier recipes with unusual ingredients – perfect for impressing a date or cooking together. I love eating fancy foods with flair!\n\nWinner: BA\n\n**Number of recipes**\n\nHands down, HF offers far more recipes.  For 3/15/25, there are approximately 62 meals, six of those are prepared microwaveable meals, and three are prep and bake.\n\nBA offers 20 options. Two are ready to cook, and none are microwaveable.\n\nWinner: HF\n\n**Premium meals**\n\nBecause HF offers many more meals, more are premium than BA. From my experience, all of the meals involving fish are considered premium and cost more (approximately $9 more per serving). BA routinely includes fish in its base price (shrimp, codfish, tilapia, and salmon) and I love fish and not having to pay extra for it with BA.\n\nLooking at the menu, BA offers only one premium meal: Duck Confit &amp; Coconut Curry Ramen, which costs $18.98 per serving. \n\nHF has six premium meals, including Shoyu-Style Ramen with Sesame-Soy Salmon for 8.99 per service.\n\nThe recipes HF charges extra for would typically be part of BA’s base plan.  I have not ordered premium meals from either.\n\nWinner: Tie.  HF is cheaper and has more options.  But fish is standard fare for BA and is always offered.\n\n**Specialty Meals:**\n\nLooking for big-batch meals, casseroles, or slow-cooker options: HF.  BA doesn’t offer these.\n\nWinner: HF\n\n**Add ons:** \n\nBoth have upsells after you’ve selected your meals for the week, but HF has many more options: smoothies (sometimes sold out), breakfast items, and decadent desserts.  I’ve ordered desserts from HF twice: blueberry cake and hazelnut cheesecake.  I ordered one and received two servings of each. The cake was microwaveable. Both were delicious but high in calories and fat, which isn’t viewable online.\n\nWinner: HF  \n\n**Order correctness**\n\nThere have been no issues with HF yet. BA has sent me the wrong delivery once. I was looking forward to my salmon meal, too. Instead of one, I received three meals instead of two, including fried chicken, falafel salad, and chorizo enchiladas. I try to stay on the lighter side of calories, but of course, I made the dishes. BA responded quickly via email and refunded my meal for that week. \n\nWinner:  HF\n\n**Packaging** \n\nI love HF’s packaging!  Both of my recipes come in separate brown paper bags. I can just open the box and pop the bags in the fridge.  Look underneath the cardboard divider for meats and pop in the freezer. \n\nBA just tosses all the individual ingredients in a box like: YOU figure it out! \n\nI like that BA lets you know the ice product is sink-friendly.  HF does not say that, so I toss the heavy packaging.\n\nWinner: HF\n\n**App** \n\nBoth apps are easy to navigate and have the recipes cards in the app in the event you lose yours.  They both have filters so you can get to your low-calorie, vegetarian or Bestseller meals quickly. I like that HF's front menu page shows the calorie content. \n\nWinner HF \n\n**Repetitiveness** \n\nI’ve been using the services for three months and still haven’t bought the same meal twice, although I easily could. Because HF has so many options, many are repeated often. The Honey Onion Crunch Chicken is almost always on the menu. That was my first dish, and it is an easy-to-make one-pan meal and delicious! I can’t wait to have it again. \n\nBA doesn’t repeat meals as often, but its unique ingredients make regular appearances. So, it has multiple recipes that use the same ingredients in its stock.\n\nWinner: BA has less repetitive/boring recipes even if they reuse ingredients.\n\n**Affordability** \n\nI order two meals each week from each (which is four meals). I think I’m still getting a discount from HF and pay about $55. BA is $10-12 more. Sometimes, with HF, I order an extra microwaveable meal for about $8 (two meals). When my HF discount is over, I should be paying about $10 more. \n\nBA is more expensive. But the quality of their food and recipes justify the price. I do wish they’d spend money on brown paper bags for individual recipes like HF. \n\nWinner: HF \n\n**Taste** \n\nBoth have good meals, and I’m saving all of my recipe cards in a binder and making notes on them (although you can save them in the app, too.)  Nothing has been awful, just items I don’t prefer: like lettuce wraps from HF.  If you’re looking for the wow factor, that’s Blue Apron.\n\nWinner:  BA\n\n",
          "score": 25,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1j6tuki/blue_apron_v_hello_fresh/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.999 | TextBlob: 0.136 | Positive words: ['love', 'good', 'delicious', 'fresh', 'quality', 'easy'] | Negative words: ['awful', 'issues']",
          "created_utc": 1741475949.0
        },
        {
          "title": "Survey to understand meal kit services",
          "text": "We are a group of stud conducting a survey as part of an academic requirement for the Service Design course at SJSU, focusing on the experience of using meal kit services like HelloFresh and Blue Apro...",
          "full_text": "We are a group of stud conducting a survey as part of an academic requirement for the Service Design course at SJSU, focusing on the experience of using meal kit services like HelloFresh and Blue Apron. The goal is to develop a concept for a new competitor service, and your insights would be incredibly valuable!\n\nThe survey will only take a few minutes to complete, and your responses will help shape a better meal kit experience.\n\nhttps://sjsu.qualtrics.com/jfe/form/SV_cZLtC2Vo7KducyG\n\nWe’d really appreciate your time and input. Thank you!",
          "score": 0,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1j0bxw0/survey_to_understand_meal_kit_services/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.948 | TextBlob: 0.198 | Positive words: ['fresh']",
          "created_utc": 1740760641.0
        },
        {
          "title": "New customer: Shipping times ",
          "text": "Signed up last week and picked Thursday as my delivery date.  I picked my choices and have been reloading the status page every day.  On Monday they started showing the FedEx tracking number, with the...",
          "full_text": "Signed up last week and picked Thursday as my delivery date.  I picked my choices and have been reloading the status page every day.  On Monday they started showing the FedEx tracking number, with the package apparently coming from Brisbane, CA.  Today(Wednesday) it still doesn’t seem to have shipped (handed over to FedEx).  What shipping method do they use?  I am in Central Oregon, nine hours by truck from Brisbane, CA, but they would probably route it via a Portland shipping hub anyway.\n\nI had previously used Blue Apron, which also ships from the Bay Area, and their packages leave on Tuesday for Thursday delivery (also FedEx).",
          "score": 2,
          "comments": 6,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1h6pnxs/new_customer_shipping_times/",
          "sentiment": "neutral",
          "confidence": 0.7,
          "explanation": "VADER: -0.039 | TextBlob: 0.003",
          "created_utc": 1733342654.0
        },
        {
          "title": "Already prepped meals?",
          "text": "Similar to factor and a prepared and ready option from Blue Apron, I got an ad that HF now has this option too. I can’t find info on their website about it but I keep getting targeted ads. Can anyone ...",
          "full_text": "Similar to factor and a prepared and ready option from Blue Apron, I got an ad that HF now has this option too. I can’t find info on their website about it but I keep getting targeted ads. Can anyone help?",
          "score": 3,
          "comments": 3,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1dy8k77/already_prepped_meals/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.728 | TextBlob: 0.067",
          "created_utc": 1720444261.0
        },
        {
          "title": "Does Hello Fresh use OnTrac to deliver? (US)",
          "text": "Hi! I had a pretty bad experience with Blue Apron and OnTrac. Just wanted to ask if which carrier Hello Fresh uses.\n\nBonus if you happen to know about Every Plate or any other grocery/recipe services....",
          "full_text": "Hi! I had a pretty bad experience with Blue Apron and OnTrac. Just wanted to ask if which carrier Hello Fresh uses.\n\nBonus if you happen to know about Every Plate or any other grocery/recipe services. Seeking unprepared meal options.\n\nThanks!",
          "score": 0,
          "comments": 17,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1drgzy8/does_hello_fresh_use_ontrac_to_deliver_us/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.883 | TextBlob: 0.050 | Positive words: ['fresh'] | Negative words: ['bad']",
          "created_utc": 1719683970.0
        },
        {
          "title": "How do you prep the chicken mush?",
          "text": "I recently switched to Hello Fresh from Blue Apron for a change in scenery and was disappointed they use the same chicken mush or as they call it, \"chopped chicken breast\". I guess this is just a thin...",
          "full_text": "I recently switched to Hello Fresh from Blue Apron for a change in scenery and was disappointed they use the same chicken mush or as they call it, \"chopped chicken breast\". I guess this is just a thing and apparently people like to cook with this stuff so I'm reaching out in hopes that some can explain to me how to enjoy cooking with it? All I end up with when I prep is half the mush stuff to paper towels which I throw away.",
          "score": 2,
          "comments": 21,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1d6ru3i/how_do_you_prep_the_chicken_mush/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.846 | TextBlob: -0.179 | Positive words: ['fresh'] | Negative words: ['disappointed']",
          "created_utc": 1717374908.0
        },
        {
          "title": "HelloFresh promos are bait-and-switches",
          "text": "I was referred with the promise of a \"free box\". I do all the work to sign up and then sorry, this promo is actually not a free box, it's 50% off plus shipping. I contact customer service and they say...",
          "full_text": "I was referred with the promise of a \"free box\". I do all the work to sign up and then sorry, this promo is actually not a free box, it's 50% off plus shipping. I contact customer service and they say ok, how about 70% off. \n\nFine. Whatever. But my referring friend now doesn't get credit for the referral because via this referral I was offered something they refused to honor. She doesn't get the $50 credit nor the referral on her account.\n\nThe product is great, maybe get some decent people on the business side, but until then I'll just refer people to Blue Apron which I have never used but would expect that you actually get what you are offered there.",
          "score": 67,
          "comments": 18,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1ay3eq1/hellofresh_promos_are_baitandswitches/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.946 | TextBlob: 0.176 | Positive words: ['great', 'fresh'] | Negative words: ['hate']",
          "created_utc": 1708702514.0
        },
        {
          "title": "Anyone else disappointed after coming back?",
          "text": "So I canceled about 3 years ago because I just didn't think it was worth it but today got a great coupon after buying my first item on Mercari. $15 for my first box, I thought ok sure. It doesn't tell...",
          "full_text": "So I canceled about 3 years ago because I just didn't think it was worth it but today got a great coupon after buying my first item on Mercari. $15 for my first box, I thought ok sure. It doesn't tell me until after paying that I can't pick my meals. One is like a spicy burger that I'm not a fan of but whatever. \n\nI go to pick next week's meals and one was like chicken and pasta and it's premium. Like wtf before it was like steak and scallops that were premium. After perusing this sub it looks to have really gone downhill. But in other news blue apron is offering a great deal so I guess I'll try them next. \n\nWith all the add ons these meal boxes can get pretty pricey. Don't get me wrong I'd probably still save $$ with the cost of food right now because I'm not going to the store and buying unnecessary crap but it's not the deal it used to be.",
          "score": 9,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/18u93ny/anyone_else_disappointed_after_coming_back/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.985 | TextBlob: 0.022 | Positive words: ['great', 'worth'] | Negative words: ['hate', 'disappointed']",
          "created_utc": 1703917921.0
        },
        {
          "title": "Thinking about trying a different meal service",
          "text": "I’ve skipped a few weeks during the holiday season and I’m thinking about trying other options rather then go back to Hello Fresh, like Blue Apron or Home Chef. Has anyone made the switch but then com...",
          "full_text": "I’ve skipped a few weeks during the holiday season and I’m thinking about trying other options rather then go back to Hello Fresh, like Blue Apron or Home Chef. Has anyone made the switch but then come back to Hello Fresh?  If you have, which one did you switch to and why did you come back?  I currently do the four person plan, twice a week. Thank you!",
          "score": 7,
          "comments": 10,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/18nzo27/thinking_about_trying_a_different_meal_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.878 | TextBlob: 0.027 | Positive words: ['fresh']",
          "created_utc": 1703199004.0
        },
        {
          "title": "Why Blue Apron and Hello Fresh can't keep their customers",
          "text": "[https://www.wsj.com/video/series/the-economics-of/why-blue-apron-and-hellofresh-cant-keep-their-customers/AF727D42-7F08-46B9-BF25-950425435EB5?mod=e2tw](https://www.wsj.com/video/series/the-economics...",
          "full_text": "[https://www.wsj.com/video/series/the-economics-of/why-blue-apron-and-hellofresh-cant-keep-their-customers/AF727D42-7F08-46B9-BF25-950425435EB5?mod=e2tw](https://www.wsj.com/video/series/the-economics-of/why-blue-apron-and-hellofresh-cant-keep-their-customers/AF727D42-7F08-46B9-BF25-950425435EB5?mod=e2tw)\n\nVery interesting news article via video about the meal kit industry",
          "score": 20,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/171gdvq/why_blue_apron_and_hello_fresh_cant_keep_their/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.686 | TextBlob: 0.317 | Positive words: ['fresh']",
          "created_utc": 1696608633.0
        },
        {
          "title": "Was trying out different meal kits",
          "text": "Using the various promotions for hello fresh, every plate, blue apron. I was supposed to pause or cancel one meal kit while I tried the other, but forgot to. \n\nI’m getting 3 different meal kit boxes n...",
          "full_text": "Using the various promotions for hello fresh, every plate, blue apron. I was supposed to pause or cancel one meal kit while I tried the other, but forgot to. \n\nI’m getting 3 different meal kit boxes next week! (17 meals for 2 people)\n\nAny tips on how to preserve the produce so it lasts for at least 3 weeks??",
          "score": 4,
          "comments": 6,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/15bd66e/was_trying_out_different_meal_kits/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.203 | TextBlob: -0.016 | Positive words: ['fresh']",
          "created_utc": 1690491168.0
        },
        {
          "title": "Look for a switch",
          "text": "What other food services rank up with hello fresh. I know there is every plate and like blue apron but I’d love feedback instead of jumping in blindly. Similar pricing or cheaper would be great as wel...",
          "full_text": "What other food services rank up with hello fresh. I know there is every plate and like blue apron but I’d love feedback instead of jumping in blindly. Similar pricing or cheaper would be great as well.",
          "score": 19,
          "comments": 14,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/13p0vlr/look_for_a_switch/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.955 | TextBlob: 0.096 | Positive words: ['love', 'great', 'fresh']",
          "created_utc": 1684784378.0
        },
        {
          "title": "Potatoe’s",
          "text": "I came from blue apron but does anyone else feel like Hellofresh use's potato a lot as veg?? I’m liking hello fresh so far but really wish they used different types of veggies for sides more often. I ...",
          "full_text": "I came from blue apron but does anyone else feel like Hellofresh use's potato a lot as veg?? I’m liking hello fresh so far but really wish they used different types of veggies for sides more often. I don’t wanna pay $3 more for a salad or asparagus.",
          "score": 5,
          "comments": 8,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/139aoc8/potatoes/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.926 | TextBlob: 0.229 | Positive words: ['fresh']",
          "created_utc": 1683343746.0
        },
        {
          "title": "Has anyone tried other food meal kit delivery options?",
          "text": "Pretty much the title. Has anyone tried other food meal kit delivery services like Chef's Plate, Goodfood, etc? What were your thoughts?\n\nThinking about cancelling my HF membership and using a competi...",
          "full_text": "Pretty much the title. Has anyone tried other food meal kit delivery services like Chef's Plate, Goodfood, etc? What were your thoughts?\n\nThinking about cancelling my HF membership and using a competitor until they send more coupon codes (and then rinse and repeat).\n\n&amp;#x200B;\n\nEDIT: We don't have Marley Spoon, Blue Apron, Dinnerly or EveryPlate in Canada.",
          "score": 28,
          "comments": 57,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/yilhkh/has_anyone_tried_other_food_meal_kit_delivery/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.664 | TextBlob: 0.117 | Positive words: ['good']",
          "created_utc": 1667243146.0
        },
        {
          "title": "It is finally happening",
          "text": "After many months of having no more than a single easy to remedy ingredient issue in the entire box, my box today had bad ginger in one recipe, bad cucumber and \"chicken strips\" that were more like \"m...",
          "full_text": "After many months of having no more than a single easy to remedy ingredient issue in the entire box, my box today had bad ginger in one recipe, bad cucumber and \"chicken strips\" that were more like \"minced chicken\" in another recipe. I've looked at the other meals and they \"look\" okay currently. I guess it is time to start looking at the competition. Any suggestion for other meal services? We are considering giving Blue Apron a go. Anyone have experience with them? Any better options (other than going to the grocery store ;) we're trying to explore more diverse meal options and you can't beat the convenience of meal delivery)?",
          "score": 3,
          "comments": 6,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/yb33tn/it_is_finally_happening/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.629 | TextBlob: -0.006 | Positive words: ['easy'] | Negative words: ['bad']",
          "created_utc": 1666484634.0
        }
      ]
    },
    "HungryRoot": {
      "total_posts": 20,
      "positive": 18,
      "negative": 2,
      "neutral": 0,
      "real_posts": [
        {
          "title": "Hungryroot vs HF?",
          "text": "We have been using hello fresh for almost a year but paused due to getting behind and just life. I also hated I couldn't put my allergies and had to keep swaps on hand. I was going to restart next mon...",
          "full_text": "We have been using hello fresh for almost a year but paused due to getting behind and just life. I also hated I couldn't put my allergies and had to keep swaps on hand. I was going to restart next month when things calm down, but someone just suggested hungryroot and it looks like what we need. Meals AND groceries, allergy friendly, about the same price for us, etc. But a part of me is wondering if it is too good to be true? Has anyone here tried it and have opinions? Or just start up again with HF and keep my swaps?\n\nAllergies are newer and are wheat (not gluten) and dairy/casein, if that changes your suggestions/opinions. Based in USA.",
          "score": 3,
          "comments": 13,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/159c3va/hungryroot_vs_hf/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.959 | TextBlob: 0.040 | Positive words: ['good', 'fresh'] | Negative words: ['hate']",
          "created_utc": 1690299805.0
        },
        {
          "title": "Vegetarian/ Vegan friendly?",
          "text": "Hi all, \nI was thinking of trying hello fresh but I am transitioning to vegan (dairy allergy, but hard to give up cheese).  \nI have tried HungryRoot before, but all the recipes tasted the same.. they ...",
          "full_text": "Hi all, \nI was thinking of trying hello fresh but I am transitioning to vegan (dairy allergy, but hard to give up cheese).  \nI have tried HungryRoot before, but all the recipes tasted the same.. they used the same premade sauces and premade tofus in their recipes. \n\nIs hello fresh vegetarian friendly? are the meals good? or are they good but repetative? has anyone found vegan meal options?",
          "score": 6,
          "comments": 23,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/uzd88b/vegetarian_vegan_friendly/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.959 | TextBlob: 0.273 | Positive words: ['good', 'fresh']",
          "created_utc": 1653702853.0
        },
        {
          "title": "How easy is it to cancel service?",
          "text": "*Update: Thank you everyone, I appreciate the help! I have just received my first box today and I’m excited to see how the food taste. 😋\n\nRecently I have been considering trying out Hellofresh, howeve...",
          "full_text": "*Update: Thank you everyone, I appreciate the help! I have just received my first box today and I’m excited to see how the food taste. 😋\n\nRecently I have been considering trying out Hellofresh, however I don’t want to start using their service if it’s too difficult to cancel later on.\n\nAlso does HelloFresh have a customer service/support number that I can call? I’ve used Hungryroot before and I was so surprised to find out they don’t have a phone number to call, they only had an email, which meant I had to wait a couple of days before getting a response. That’s not a dealbreaker for me though, I’m just curious.\n\nI just want to know what I’m getting myself into before giving it a go.",
          "score": 8,
          "comments": 11,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/udit42/how_easy_is_it_to_cancel_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.941 | TextBlob: 0.074 | Positive words: ['fresh', 'easy']",
          "created_utc": 1651107727.0
        },
        {
          "title": "Working on a project from hello fresh and need some input.",
          "text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other comp...",
          "full_text": "Hey everyone I’m currently working on a project for hello fresh and wanted some input about your experiences with company. I basically wanted to ask why do you choose hello fresh instead of other companies like Blue Apron, Green Chief, Hungry Root, Sunbasket, Home Chef, etc. ?",
          "score": 0,
          "comments": 5,
          "subreddit": "hellofresh",
          "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
          "created_utc": 1744158624.0
        },
        {
          "title": "Honest Hungryroot review",
          "text": "I've been trying Hungryroot for a few months now and here's my review. \n\n1. To start, I have a lot of allergies and dietary restrictions which had me extremely stressed when trying to look up recipes ...",
          "full_text": "I've been trying Hungryroot for a few months now and here's my review. \n\n1. To start, I have a lot of allergies and dietary restrictions which had me extremely stressed when trying to look up recipes and make food. I was desperate to find something to make my life easier.  I did the quiz on their website and of course they wanted me to pay before seeing the food options. No thanks. I emailed customer service and they basically gave me \"we have a lot of options so give us a try\" answer. Um, no. Not if I don't know if I can eat the food! After some back and forth and a bad review for the rep I finally received the link for all of their food options. I found a few recipes I could eat so I decided to give it a try. Sifting through the food options does become a lot easier after you sign up because you can kind of create your profile and preferences. I do not like this, I wish they were transparent about everything from the beginning.\n2. I've gotten probably 8 boxes by now, 1 has been late and some of the food was bad. I've had a few bad items in multiple boxes. I've always gotten a quick refund with extra for the inconvenience and they say they talked to the packing team. My last box was perfect so hopefully things are improving? We shall see. (Of note: customer service starting after my first interaction has been very good)\n3. I pay about $105 each week for just me. This includes \"points\" for 3 lunches, 4 dinners, and 5-7 servings of sweets. Portion sizes are huge in my opinion. I started stretching this out for almost every meal for the week. I always end up eating somewhere else for 1-2 meals for the week but the food I get from hungryroot lasts me for the rest of the week. If something tells me I can get 2 servings out of it, I can typically make it into 4 meals. I always end up having enough food to feed my husband a few meals out of the week as well.\n4. The food is pretty fresh which is a huge plus for me because I can't eat a lot of preservatives without issues. The downside is it spoils pretty quickly. I had 2 bags of mozzarella cheese in the fridge, one from Hungryroot and one from Walmart. The one from hungryroot has spoiled already in less than 2 months. \n5. 99% of the meals I've gotten take less than 20 minutes to make and are very easy. This is perfect because I really hate cooking and don't have a lot of time anyway. I did get one meal that took forever to make and it was awful so I try to keep to the more simple options. \n6. Most of the food I get is really tasty! I am a very picky eater (on top of everything else lol) so a huge plus for me.\n\nI'm conclusion, I will be keeping my hungryroot subscription because it makes my life so much easier. If I didn't have so many restrictions I probably wouldn't use it because of cost. I did look at quite a lot of meal service options and none of the others are as good for my dietary restrictions. Hope this helps someone looking into it. \n\n",
          "score": 11,
          "comments": 6,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1o91859/honest_hungryroot_review/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.993 | TextBlob: 0.112 | Positive words: ['good', 'fresh', 'easy', 'tasty'] | Negative words: ['hate', 'awful', 'bad', 'spoiled', 'issues']",
          "created_utc": 1760707425.0
        },
        {
          "title": "Dos Hungry root give smaller portions and snacks overtime?",
          "text": "Got my third box of Hungryroot today and it seems like the snacks they provide are smaller and less than previously. I remember the first box was huuuge and had a decent amount of snacks and breakfast...",
          "full_text": "Got my third box of Hungryroot today and it seems like the snacks they provide are smaller and less than previously. I remember the first box was huuuge and had a decent amount of snacks and breakfast options. The second box got delivered with all of the refrigerator goods covered in the ice back gel and a few of them busted and we were directed to throw them out. That box was about 3/4 to 1/2 the size of the first one and still had a few more snacks than this one. For example, the first box gave two bags of partake chocolate chip cookies. The second box had a bag of sugar cookies that was bigger than the small snack size of the chocolate chip cookie bags. This box gave a single sleeve of three partake chocolate chip cookies (they are small cookies). There are a few other snacks in this box just not as much as the first or second box.\n\nIt also just seems like less items. Has this happened to anyone else/something to worry about with them?",
          "score": 3,
          "comments": 0,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1nztubg/dos_hungry_root_give_smaller_portions_and_snacks/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.353 | TextBlob: 0.003 | Positive words: ['good']",
          "created_utc": 1759781314.0
        },
        {
          "title": "Hungryroot -- would be great if they weren't so unreliable",
          "text": "I have been trying Hungryroot for almost a year now. I was looking for a meal service that provided relatively quick/easy meals with minimal cooking. What I like about them is the ability to order mea...",
          "full_text": "I have been trying Hungryroot for almost a year now. I was looking for a meal service that provided relatively quick/easy meals with minimal cooking. What I like about them is the ability to order meals (to make) but also groceries and ready-made items. I also like that they seem relatively healthy compared to other options -- more veggie options, organic, etc.\n\nI have had repeat issues with them not sending the right items -- but honestly that would be mild compared to the issues I have now had - repeatedly -- where food was not packed well and so refrigerated items did not arrive cool or cold. I do not live in a hot climate so no real excuse for this.\n\nIt seems like they have gotten worse since I first signed up and/or are cheaping out on ice packs. For my orders I used to usually have a couple of icepacks and lately it's just been one.\n\nBut the real problem is multiple times items were stored in the top of the box without any icepack.\n\nIt is incredibly frustrating to not have the food you planned on eating for the week but what is most upsetting for me is to have to throw out whole packages of food. One of the reasons I justify using mail service is to cut down on waste. \n\nOne thing I will say is that -- unlike other reviews I have read -- I have had zero problems getting ahold of customer service and every single time I have had a complaint they have given me a credit for food, refund, etc. \n\nGetting my money back hasn't been a problem -- but being able to rely on their service doesn't seem to be possible. I'll definitely keep an eye out to see if they make improvements in the future because I really do like their products. ",
          "score": 6,
          "comments": 3,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1nuqk0s/hungryroot_would_be_great_if_they_werent_so/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.425 | TextBlob: 0.083 | Positive words: ['great', 'easy'] | Negative words: ['waste', 'problems', 'issues']",
          "created_utc": 1759269463.0
        },
        {
          "title": "Better oils in premade meal kits?",
          "text": "Hi all, does anyone know of premade meal kits that don’t use such refined oils or at least use less? I have recently been diagnosed with dysautonomia/POTS and ME/CFS and I really want to put healthy f...",
          "full_text": "Hi all, does anyone know of premade meal kits that don’t use such refined oils or at least use less? I have recently been diagnosed with dysautonomia/POTS and ME/CFS and I really want to put healthy food in my body as I am struggling hard with my health. Unfortunately, I can’t stand long enough to cook right now so I need ready made meals or very minimum prep. I tried Hungryroot and hated them for many reasons so they aren’t an options. Open to other suggestions. Thank you ",
          "score": 1,
          "comments": 3,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1nubt6c/better_oils_in_premade_meal_kits/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.254 | TextBlob: 0.003 | Negative words: ['hate']",
          "created_utc": 1759235226.0
        },
        {
          "title": "Heart healthy, low sodium",
          "text": "I’m an only child and live 900 miles from my parents. My 81 year old dad recently had a major heart attack and mom has some memory issues. They are very much meat and potato’s drown it in salt for tas...",
          "full_text": "I’m an only child and live 900 miles from my parents. My 81 year old dad recently had a major heart attack and mom has some memory issues. They are very much meat and potato’s drown it in salt for taste kinda people. I can’t get her to understand that she has to change how dad eats. I’m  currently flying out every other weekend and meal prepping what I can but it’s not enough and isn’t sustainable. They live in a rural area and there are no local resources. I’m trying to find a heart healthy meal delivery service that can do two meals a day, seven days a week. I’m not worried about the cost, heat and eat would be preferred. Hungryroot has low sodium options but doesn’t seem to do a full week. Any suggestions on a full week low sodium service would be greatly appreciated. ",
          "score": 2,
          "comments": 4,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1npszp7/heart_healthy_low_sodium/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.911 | TextBlob: 0.124 | Positive words: ['great'] | Negative words: ['issues']",
          "created_utc": 1758760960.0
        },
        {
          "title": "Hungryroot review, pleasantly surprised",
          "text": "New customer, 3rd order, and so far so good. I live alone and work long hours, and deal with depression. Used to eat out all of the time but needed a change. A friend recommended it, told me how to be...",
          "full_text": "New customer, 3rd order, and so far so good. I live alone and work long hours, and deal with depression. Used to eat out all of the time but needed a change. A friend recommended it, told me how to best use my points, and voila, every other week, I buy staples to round out and viola! Im not a big eater so the portions are great, and i dont waste as much as I used to when I went grocery shopping. Its so hard to shop when single ",
          "score": 27,
          "comments": 13,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1ni62gr/hungryroot_review_pleasantly_surprised/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.972 | TextBlob: 0.137 | Positive words: ['great', 'good', 'recommend'] | Negative words: ['waste']",
          "created_utc": 1757991196.0
        },
        {
          "title": "Unauthorized Charges and No Customer Support",
          "text": "I subscribed to Hungryroot in **September 2024** and **immediately canceled**. I never received a single product or shipment from them. Now, a year later in **September 2025**, I suddenly find a charg...",
          "full_text": "I subscribed to Hungryroot in **September 2024** and **immediately canceled**. I never received a single product or shipment from them. Now, a year later in **September 2025**, I suddenly find a charge on my credit card from Hungryroot.\n\nFor the past three days, I have been **trying to dispute this charge** and reach someone for help—but **nobody answers**. To make matters worse, they are now emailing me that a shipment is on its way, even though I never placed an order, never wanted one, and never received anything from them in the past.\n\nThis feels completely unacceptable: **unauthorized billing, no support, and misleading communication.** If you value your time, money, and peace of mind, be very careful before giving Hungryroot your payment information.",
          "score": 6,
          "comments": 2,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1nblkt1/unauthorized_charges_and_no_customer_support/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.747 | TextBlob: -0.125",
          "created_utc": 1757332199.0
        },
        {
          "title": "Meal prep service",
          "text": "Looking at unify or hungryroot for meal services. Do these services really save money? I spend around $75-$125 each or every other week. How easy are the meals to prep and do they come with already ma...",
          "full_text": "Looking at unify or hungryroot for meal services. Do these services really save money? I spend around $75-$125 each or every other week. How easy are the meals to prep and do they come with already made meals? I want healthy options that are mostly seafood and Mediterranean diet. Thanks! ",
          "score": 2,
          "comments": 8,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1n8rp09/meal_prep_service/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.918 | TextBlob: 0.293 | Positive words: ['easy']",
          "created_utc": 1757034232.0
        },
        {
          "title": "Any meal kits out there w/o seed oils?",
          "text": "I have tried to different prepared meals or meal kit deliveries so far and had no luck. Hungryroot uses seed oils in everything and Sprinly has good quality foods but half of it was always spoiled whe...",
          "full_text": "I have tried to different prepared meals or meal kit deliveries so far and had no luck. Hungryroot uses seed oils in everything and Sprinly has good quality foods but half of it was always spoiled when I received it.  ",
          "score": 0,
          "comments": 23,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1n7rdw2/any_meal_kits_out_there_wo_seed_oils/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.168 | TextBlob: 0.158 | Positive words: ['good', 'quality'] | Negative words: ['spoiled']",
          "created_utc": 1756934497.0
        },
        {
          "title": "No, seriously - BEWARE OF HUNGRY ROOT! How are they still around?!",
          "text": "I know this has been said before but I am now making it my mission to spread this far and wide - if you're considering using Hungry Root, turn back now!!! \n\nThis was by FAR the worst customer service/...",
          "full_text": "I know this has been said before but I am now making it my mission to spread this far and wide - if you're considering using Hungry Root, turn back now!!! \n\nThis was by FAR the worst customer service/delivery experience of my life and I think it's fair to say they committed a fair amount of scam/fraud. \n\nI've tried to make this as easy to read as possible because I can't believe this and hate this company so much and want to save everybody from their evil: \n\nSNEAKY CHARGES: Firstly, everyone should know they charge you immediately for even viewing the cart. It's VERY sneaky &amp; I have never experienced that before on a site. $150 is charged immediately to my card. But, okay fine, whatever - let's put that aside; I did give them my CC info after all. \n\nLATE DELIVERY, NO NOTIFICATIONS: My box was supposed to come on a Monday. Great, I made arrangements to make sure my schedule would work for that. I didn't receive any updates or notifications.....Monday night rolls around, and nothing. Shipping label says not created. ???? \n\nNO RESPONSE/NO CUSTOMER SERVICE PHONE NUMBER: Okay, they must be having delivery issues. I am a reasonable person. I reach out to customer service - they ONLY do email/text, no phone number. There is no opportunity to talk with someone live. \n\nTOOK OVER 2 DAYS (yes, 2 days) TO GET RESPONSE: Their automated message said \"please bear with us - higher volume than usual - will take 24-48 hours for response\". Yes, 48 hours. I'm pretty frustrated. Keep in mind, again, NO other way to contact them besides this. I'm down $150 with no meals and no one will respond to me. There is literally no way to get in touch besides email or text. \n\nI HAD TO BE PERSISTENT TO EVEN GET A RESPONSE: I'm convinced they wouldn't have even responded past 48 hours if I hadn't have kept reaching out. I give them time to respond. The 48 hour mark is approaching and I have heard NOTHING. Nada. No food, no response, and still $150 drained. $150, unfortunately, is a lot of money for me and I either need it refunded or I need my food for the week. I no longer have grocery money. So I get persistent. I text and email their support constantly. I need a response!!!! After probably my 20th text in a row (again, see: desperate) I get a response. \n\nABSOLUTELY INSANE CUSTOMER SERVICE: The customer service rep acknowledges the delay and apologizes. The rest of the message is a copy-paste nonsense that has nothing to do with me not receiving my order or the lack of communication. \"We packed your delivery specifically for you and how you live! Make sure to refrigerate!\" Um...what? I respond immediately: Where is my order, what's going on on, and I need some sort of refund. The rep says my order will now be 3 days late, possibly more. This is crazy - my week is now halfway over and I have no food and my meal planning is completely shot. I again ask for a refund. Another BS copy/paste response. So I ask again. FINALLY, the rep says.....get ready, are you sitting down?....\n\"As a one-time courtesy, we've issued a $45 refund to your account. Please know I'm always here if you need anything!\" \n.......My followup responses go unanswered. \n\nGOT MY BOX 3 DAYS LATE WITH NO NOTIFICATION: right after this customer service interaction, my box arrives! Yay! It looks like it came from war. Every single thing inside is dented and beat up. Things are melting and gross looking and it was only outside for maybe 20 minutes. But wait!! Are you ready for the best part!!!.......\n\nENTIRE ORDER WAS WRONG: yep! You read that right! The ENTIRE order was wrong! Foods I can't eat, meals I never picked or heard of, ingredients missing, AWESOME!! I'm literally in disbelief looking at it after going through all of this - I thought I would at least have meals. Nope. Okay, I immediately go back to customer service. And I'm not waiting 48 hours. I have no food, am down $105, (they so generously gave me $45!!!) and nobody has helped me. I text them again many times in a row. \n\nSomeone responds 2 hours later:\n\"I've refunded your card $45 as a one-time courtesy\". \nMy followup texts demanding full refund go unanswered.\n\nSUMMARY: As someone who is struggling financially but wanted to treat myself to a nice meal plan to eat healthier and help with my dietary allergies, this was an absolute nightmare. They still owe me the full refund but won't respond. I'm posting this for people like me - or even if you're not! - who think this will make their life easier. It won't, it's not, and somehow they'll still scam you out of money. This was mind-blowingly bad service - actually, I can't even say service - it was a straight up con job. Their customer response strategy is INSANE; no phone number or opportunity to talk with someone live, and 48 hour response times even when you're missing your food. No full refunds, even when absolutely everything is wrong. \nI am a level-headed person (lol even if this doesn't seem like it) who understands delays and mishaps. But this, no communication, no help, no acknowledgment, and being so casual about wronging their customer? I don't understand. \n\nSo please, this is my warning - go with another service instead. Thanks Hungryroot! I can't wait to enjoy my soggy pork loins (I don't eat pork) and 4 bags of broccoli! ",
          "score": 243,
          "comments": 92,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1mvddu7/no_seriously_beware_of_hungry_root_how_are_they/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.971 | TextBlob: 0.023 | Positive words: ['great', 'easy'] | Negative words: ['hate', 'bad', 'worst', 'issues']",
          "created_utc": 1755692814.0
        },
        {
          "title": "New to HungryRoot - DO NOT RECOMMEND",
          "text": "I got my first HungryRoot box a couple weeks ago. They texted me the day before saying they had to make a substitution due to running out of ground beef patties. (One of my recipes was hamburgers and ...",
          "full_text": "I got my first HungryRoot box a couple weeks ago. They texted me the day before saying they had to make a substitution due to running out of ground beef patties. (One of my recipes was hamburgers and they subbed pre-cooked chili lime chicken instead of ground beef patties…? No thanks.) That’s just unacceptable for me… I chose my recipes 6 days in advance and had no opportunity to select the substitution myself. AND once I got the box, two major ingredients were missing altogether. I complained and was partially refunded, thinking I wouldn’t be trying them again. But plot twist - I actually liked the food, so I decided to give them another try. Maybe it was a fluke.\n\nI was supposed to get my second box yesterday (Saturday), and it is now Sunday evening, and delivery has been rescheduled for tomorrow. Besides some seasonings and some pretzel buns, literally everything else in the box will be spoiled.\n\nJust completely inexcusable issues for a meal delivery service. The entire point is to save time and effort, and twice now I’ve had to restrategize my meal plan for the week, which defeats the entire purpose.\n\nWelp, I’m off to Trader Joe’s…",
          "score": 51,
          "comments": 21,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1mmx5jl/new_to_hungryroot_do_not_recommend/",
          "sentiment": "negative",
          "confidence": 0.8,
          "explanation": "VADER: -0.184 | TextBlob: -0.020 | Positive words: ['recommend'] | Negative words: ['spoiled', 'issues']",
          "created_utc": 1754867692.0
        },
        {
          "title": "Hungryroot is a ripoff.",
          "text": "Hungryroot uses a point system and charges you weekly whether you order food or not.  If you try to cancel you subscription, they cancel orders you already paid and keep the money.  They will not give...",
          "full_text": "Hungryroot uses a point system and charges you weekly whether you order food or not.  If you try to cancel you subscription, they cancel orders you already paid and keep the money.  They will not give you a refund even if you specifically request not to have a delivery that week, so you end up having more points than you can spend.  And of course half of my meals were missing items, for which they gave me money back on their \"wallet\" but again no refund. On top of that, their \"recipes\" are just cook the meat, cook the veggies separately or have a salad with the meat.  You are better off buying the food directly from Publix (yes, I found one of their precooked meats there), Sprouts, Whole Foods or another grocery store.  Do not do business with this company. If you want food delivered, go somewhere... anywhere else.",
          "score": 30,
          "comments": 13,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1m2reqs/hungryroot_is_a_ripoff/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.625 | TextBlob: 0.179",
          "created_utc": 1752808173.0
        },
        {
          "title": "Hungryroot Review After 2 Weeks",
          "text": "Spoiler: I won’t be renewing.\n\nMy girlfriend and I tried Hungryroot for 2 weeks. Please keep in mind this was after trying EveryPlate and Hello Fresh. Comparatively, HR is terrible. The food quality, ...",
          "full_text": "Spoiler: I won’t be renewing.\n\nMy girlfriend and I tried Hungryroot for 2 weeks. Please keep in mind this was after trying EveryPlate and Hello Fresh. Comparatively, HR is terrible. The food quality, the recipes, the way the instructions are printed — it’s all subpar compared to EveryPlate and Hello Fresh. They send full bags of ingredients for one recipe. Why am I getting a full package of sliced cheese for two cheeseburgers…? They also send other companies’ products. If I wanted Kevin’s pre-cooked chicken, I’d have just gone to Costco. The recipes we’ve had instructed us to maybe heat up a couple things in the microwave and brown the protein in a pan. The other 2 boxed plans send ingredients and you get to ACTUALLY cook (make your own sauces, pickle your own vegetables, etc.). This feels like a huge scam and we’ll both be cancelling. It isn’t worth it for the money. Spend elsewhere.",
          "score": 14,
          "comments": 13,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1lpg6lx/hungryroot_review_after_2_weeks/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.459 | TextBlob: 0.104 | Positive words: ['fresh', 'worth', 'quality'] | Negative words: ['terrible']",
          "created_utc": 1751410836.0
        },
        {
          "title": "Alternative to Hungryroot?",
          "text": "I have been doing Hungryroot for a few months now, and just have been generally underwhelmed by the food. \nWhat I do love is the speed with which I can cook meals but more and more I find myself remov...",
          "full_text": "I have been doing Hungryroot for a few months now, and just have been generally underwhelmed by the food. \nWhat I do love is the speed with which I can cook meals but more and more I find myself removing, swapping portions of their meals out, changing sides and just basically grocery shopping on their app. Some of their meats are great, but others have an odd flavor.\nI like the combo of precooked meats and pre portioned and pre cut vegetables. I can put most of these meals together in 15 minutes which is awesome. \nI like the option to get groceries but that isn’t mandatory. \n\nI have done factor in the past, which was fine but again underwhelming, and Gobble, which has by far had the best tasting food but lots of prep work and clean up. \nGreenchef, blue apron, hello fresh, similar to gobble. Just more prep work than I want to do on a weeknight after work. \n \nWondering if there is a similar option maybe with more variety or better tasting meals? I feel like I may just have to go back to cooking from scratch on my own.\n",
          "score": 3,
          "comments": 8,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1l7hl22/alternative_to_hungryroot/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.991 | TextBlob: 0.327 | Positive words: ['love', 'great', 'fresh']",
          "created_utc": 1749505734.0
        },
        {
          "title": "Hungryroot",
          "text": "Is anyone else having issues with just bizarre things being thrown into their boxes instead of the ingredients needed for the recipes!?!",
          "full_text": "Is anyone else having issues with just bizarre things being thrown into their boxes instead of the ingredients needed for the recipes!?!",
          "score": 2,
          "comments": 4,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1l4guk9/hungryroot/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: -0.437 | TextBlob: 0.625 | Negative words: ['issues']",
          "created_utc": 1749175180.0
        },
        {
          "title": "Weekly meals, side dishes only?!",
          "text": "Good morning! \nI have been ordering sunbasket for the past few years (i don’t usually get the ready meals, rather i get the meals to make at home with the ingredients they send) \nI do think their prot...",
          "full_text": "Good morning! \nI have been ordering sunbasket for the past few years (i don’t usually get the ready meals, rather i get the meals to make at home with the ingredients they send) \nI do think their protein (fish, seafood, meats) are so so in quality. \nMy question is, does a service exist that only delivers side dishes? \nI accidentally subscribed to hungryroot, and looking at the offers for the week i would like to start, i am definitely not impressed! (I look for dairy free, kid friendly and organic)\n\nAny suggestions? \nTIA",
          "score": 2,
          "comments": 4,
          "subreddit": "mealkits",
          "url": "https://reddit.com/r/mealkits/comments/1l31ia9/weekly_meals_side_dishes_only/",
          "sentiment": "positive",
          "confidence": 0.8,
          "explanation": "VADER: 0.956 | TextBlob: 0.068 | Positive words: ['good', 'quality']",
          "created_utc": 1749030672.0
        }
      ]
    }
  },
  "individual_post_analysis": [
    {
      "brand": "HelloFresh",
      "post_number": 1,
      "title": "Hello fresh referral codes?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.361 | TextBlob: 0.067 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1oci6vn/hello_fresh_referral_codes/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 2,
      "title": "Ghosted by HelloFresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.180 | TextBlob: 0.142 | Positive words: ['good', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1obcmdh/ghosted_by_hellofresh/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 3,
      "title": "Anyone else notice a decrease in meat quality?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.716 | TextBlob: 0.070 | Positive words: ['great', 'fresh', 'convenient', 'quality'] | Negative words: ['terrible', 'awful']",
      "url": "https://reddit.com/r/hellofresh/comments/1ob8d2b/anyone_else_notice_a_decrease_in_meat_quality/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 4,
      "title": "How do I find out about all of the different special recipes, etc?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.983 | TextBlob: 0.104 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o8qtn3/how_do_i_find_out_about_all_of_the_different/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 5,
      "title": "Price Increased too Much",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.382 | TextBlob: 0.250 | Positive words: ['fresh', 'worth']",
      "url": "https://reddit.com/r/hellofresh/comments/1o8nay6/price_increased_too_much/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 6,
      "title": "Pending Charge- Haven’t Ordered in 2 Years",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.512 | TextBlob: 0.042 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o7qhli/pending_charge_havent_ordered_in_2_years/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 7,
      "title": "This has been a terrible experience.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.762 | TextBlob: 0.005 | Positive words: ['delicious', 'fresh', 'happy'] | Negative words: ['terrible', 'cancelled']",
      "url": "https://reddit.com/r/hellofresh/comments/1o7m0r2/this_has_been_a_terrible_experience/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 8,
      "title": "What’s the best dish you’ve ever had from HelloFresh?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.963 | TextBlob: 0.608 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o7ggfl/whats_the_best_dish_youve_ever_had_from_hellofresh/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 9,
      "title": "First order frustration",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.270 | TextBlob: 0.195 | Positive words: ['good', 'fresh', 'worth']",
      "url": "https://reddit.com/r/hellofresh/comments/1o5yz8g/first_order_frustration/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 10,
      "title": "Rant? All my selected meals reset",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.149 | TextBlob: -0.012 | Positive words: ['love', 'great', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o5yrhf/rant_all_my_selected_meals_reset/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 11,
      "title": "please send unwanted recipe pages",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.872 | TextBlob: 0.333 | Positive words: ['love', 'fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1o556yz/please_send_unwanted_recipe_pages/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 12,
      "title": "Best way to get a box refunded?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.983 | TextBlob: 0.093 | Positive words: ['great', 'fresh'] | Negative words: ['disappointed']",
      "url": "https://reddit.com/r/hellofresh/comments/1o4n9ej/best_way_to_get_a_box_refunded/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 13,
      "title": "Shrimp dishes disappearing",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.477 | TextBlob: 0.267 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o4jd6v/shrimp_dishes_disappearing/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 14,
      "title": "Homemade Salami and Mozzarella Focaccia Pizza",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.953 | TextBlob: 0.297 | Positive words: ['love', 'recommend', 'delicious', 'fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1o49oaf/homemade_salami_and_mozzarella_focaccia_pizza/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 15,
      "title": "Potato &amp; mushroom soup - fall flavors menu",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.937 | TextBlob: 0.325 | Positive words: ['great', 'recommend', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2oakx/potato_mushroom_soup_fall_flavors_menu/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 16,
      "title": "Other Meal Kits",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 17,
      "title": "Hello Fresh Ready Made Meals",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.781 | TextBlob: 0.140 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2mbhy/hello_fresh_ready_made_meals/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 18,
      "title": "Just reactivated five days ago and got this...🤦",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.318 | TextBlob: 0.150 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2jobu/just_reactivated_five_days_ago_and_got_this/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 19,
      "title": "It took me 1 kit to realize I got scammed by hello fresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.447 | TextBlob: 0.025 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/mealkits/comments/1o7nait/it_took_me_1_kit_to_realize_i_got_scammed_by/"
    },
    {
      "brand": "HelloFresh",
      "post_number": 20,
      "title": "Best meal kit when it comes to price and health?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.178 | TextBlob: 0.241 | Positive words: ['amazing', 'good', 'recommend', 'fresh', 'quality']",
      "url": "https://reddit.com/r/mealkits/comments/1mze27l/best_meal_kit_when_it_comes_to_price_and_health/"
    },
    {
      "brand": "Factor",
      "post_number": 1,
      "title": "No ready made meals, second week in a row!",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.540 | TextBlob: 0.086 | Positive words: ['good']",
      "url": "https://reddit.com/r/hellofresh/comments/1ocebt8/no_ready_made_meals_second_week_in_a_row/"
    },
    {
      "brand": "Factor",
      "post_number": 2,
      "title": "Customer Service",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.794 | TextBlob: 0.297 | Positive words: ['good', 'fresh'] | Negative words: ['cancelled']",
      "url": "https://reddit.com/r/hellofresh/comments/1o0hmog/customer_service/"
    },
    {
      "brand": "Factor",
      "post_number": 3,
      "title": "BBQ Pineapple Flatbreads",
      "sentiment": "positive",
      "confidence": 0.6,
      "explanation": "VADER: 0.139 | TextBlob: 0.137 | Positive words: ['good']",
      "url": "https://reddit.com/r/hellofresh/comments/1mxr56r/bbq_pineapple_flatbreads/"
    },
    {
      "brand": "Factor",
      "post_number": 4,
      "title": "Anyone have a business email for Hello Fresh YT partnerships?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.960 | TextBlob: 0.142 | Positive words: ['fresh'] | Negative words: ['disappointed']",
      "url": "https://reddit.com/r/hellofresh/comments/1mql5tc/anyone_have_a_business_email_for_hello_fresh_yt/"
    },
    {
      "brand": "Factor",
      "post_number": 5,
      "title": "HF vs Shopping",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.753 | TextBlob: 0.003 | Positive words: ['quality'] | Negative words: ['waste']",
      "url": "https://reddit.com/r/hellofresh/comments/1m2eu2e/hf_vs_shopping/"
    },
    {
      "brand": "Factor",
      "post_number": 6,
      "title": "It’s been real y’all 🥲 any alternative success??",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.979 | TextBlob: 0.145 | Positive words: ['great'] | Negative words: ['waste']",
      "url": "https://reddit.com/r/hellofresh/comments/1m1762v/its_been_real_yall_any_alternative_success/"
    },
    {
      "brand": "Factor",
      "post_number": 7,
      "title": "HelloFresh alternatives that let you view upcoming menus before charging your CC?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.710 | TextBlob: -0.103 | Positive words: ['fresh', 'quality'] | Negative words: ['awful', 'waste']",
      "url": "https://reddit.com/r/hellofresh/comments/1lcvxbd/hellofresh_alternatives_that_let_you_view/"
    },
    {
      "brand": "Factor",
      "post_number": 8,
      "title": "Factor was originally offered at the same price point on HelloFresh a few months ago, but I’ve recently noticed a $2.99 upcharge per serving. Is this happening everywhere or just in Canada?",
      "sentiment": "positive",
      "confidence": 0.6,
      "explanation": "VADER: 0.000 | TextBlob: 0.044 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1lcgqi5/factor_was_originally_offered_at_the_same_price/"
    },
    {
      "brand": "Factor",
      "post_number": 9,
      "title": "Quality rant from 7 year customer",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.984 | TextBlob: 0.110 | Positive words: ['great', 'amazing', 'fresh', 'quality', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1k315j0/quality_rant_from_7_year_customer/"
    },
    {
      "brand": "Factor",
      "post_number": 10,
      "title": "My box was delivered in a Factor van",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.457 | TextBlob: 0.250",
      "url": "https://reddit.com/r/hellofresh/comments/1k035lb/my_box_was_delivered_in_a_factor_van/"
    },
    {
      "brand": "Factor",
      "post_number": 11,
      "title": "Ready to heat meals?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.867 | TextBlob: 0.267 | Positive words: ['good']",
      "url": "https://reddit.com/r/hellofresh/comments/1jg45v2/ready_to_heat_meals/"
    },
    {
      "brand": "Factor",
      "post_number": 12,
      "title": "Blue Apron v. Hello Fresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.999 | TextBlob: 0.136 | Positive words: ['love', 'good', 'delicious', 'fresh', 'quality', 'easy'] | Negative words: ['awful', 'issues']",
      "url": "https://reddit.com/r/hellofresh/comments/1j6tuki/blue_apron_v_hello_fresh/"
    },
    {
      "brand": "Factor",
      "post_number": 13,
      "title": "Is the free pre-made meal or free breakfast item for life a better deal?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.964 | TextBlob: 0.496 | Positive words: ['good']",
      "url": "https://reddit.com/r/hellofresh/comments/1j0kb5z/is_the_free_premade_meal_or_free_breakfast_item/"
    },
    {
      "brand": "Factor",
      "post_number": 14,
      "title": "Italian chicken over lemony spaghetti 1/10",
      "sentiment": "positive",
      "confidence": 0.6,
      "explanation": "VADER: 0.128 | TextBlob: -0.105 | Negative words: ['horrible']",
      "url": "https://reddit.com/r/hellofresh/comments/1hxmys6/italian_chicken_over_lemony_spaghetti_110/"
    },
    {
      "brand": "Factor",
      "post_number": 15,
      "title": "Looking for some additional opinions. ",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.557 | TextBlob: 0.054",
      "url": "https://reddit.com/r/hellofresh/comments/1hx4jek/looking_for_some_additional_opinions/"
    },
    {
      "brand": "Factor",
      "post_number": 16,
      "title": "Best meal prep service?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.951 | TextBlob: 0.494 | Positive words: ['recommend', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1hdrmg1/best_meal_prep_service/"
    },
    {
      "brand": "Factor",
      "post_number": 17,
      "title": "Curious as to what users think about this idea: Nutrition tracking barcode on HelloFresh's recipe",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.960 | TextBlob: 0.110 | Positive words: ['fresh', 'convenient', 'helpful']",
      "url": "https://reddit.com/r/hellofresh/comments/1g0o564/curious_as_to_what_users_think_about_this_idea/"
    },
    {
      "brand": "Factor",
      "post_number": 18,
      "title": "Do You Ever Think Missing Boxes Were Merely Stolen By Delivery Partners?",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.876 | TextBlob: -0.138 | Positive words: ['convenient']",
      "url": "https://reddit.com/r/hellofresh/comments/1fzdtr0/do_you_ever_think_missing_boxes_were_merely/"
    },
    {
      "brand": "Factor",
      "post_number": 19,
      "title": "Already prepped meals?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.728 | TextBlob: 0.067",
      "url": "https://reddit.com/r/hellofresh/comments/1dy8k77/already_prepped_meals/"
    },
    {
      "brand": "Factor",
      "post_number": 20,
      "title": "Any Factor/ hello fresh Workers from Aurora Illinois in this group? ",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.318 | TextBlob: 0.300 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1dnlc1z/any_factor_hello_fresh_workers_from_aurora/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 1,
      "title": "Pairing two meal kit services (Butcherbox + _____)",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.264 | TextBlob: -0.056 | Positive words: ['good', 'recommend', 'quality'] | Negative words: ['bad', 'waste']",
      "url": "https://reddit.com/r/mealkits/comments/17imysi/pairing_two_meal_kit_services_butcherbox/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 2,
      "title": "Continue HelloFresh or switch to Butcher Box?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.982 | TextBlob: 0.362 | Positive words: ['great', 'good', 'fresh', 'quality']",
      "url": "https://reddit.com/r/mealkits/comments/1iawikc/continue_hellofresh_or_switch_to_butcher_box/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 3,
      "title": "Sirloin steaks - always disappointing?",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.942 | TextBlob: -0.513 | Negative words: ['bad']",
      "url": "https://reddit.com/r/mealkits/comments/orotvj/sirloin_steaks_always_disappointing/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 4,
      "title": "Get a $30 discount off Butcher Box with this survey!",
      "sentiment": "neutral",
      "confidence": 0.7,
      "explanation": "VADER: 0.000 | TextBlob: 0.000",
      "url": "https://reddit.com/r/mealkits/comments/830wam/get_a_30_discount_off_butcher_box_with_this_survey/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 5,
      "title": "I need Bacon related recipes!!! I was accidentally shipped 50lbs of bacon",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.455 | TextBlob: 0.000",
      "url": "https://reddit.com/r/Cooking/comments/lxz41a/i_need_bacon_related_recipes_i_was_accidentally/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 6,
      "title": "What is the ideal temperature for the refrigerator?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.751 | TextBlob: 0.300",
      "url": "https://reddit.com/r/Cooking/comments/j2tccn/what_is_the_ideal_temperature_for_the_refrigerator/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 7,
      "title": "How to defrost 5 lbs bulk meat",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.985 | TextBlob: 0.055 | Positive words: ['quality'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/Cooking/comments/gow8h4/how_to_defrost_5_lbs_bulk_meat/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 8,
      "title": "What are your thoughts on butcherbox?",
      "sentiment": "positive",
      "confidence": 0.6,
      "explanation": "VADER: 0.000 | TextBlob: 0.175",
      "url": "https://reddit.com/r/Cooking/comments/f0yt2h/what_are_your_thoughts_on_butcherbox/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 9,
      "title": "Never cooked pork butt. Butcherbox just sent a 6.18 lb bone-in pork butt. Not sure what to do with it.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.664 | TextBlob: -0.043",
      "url": "https://reddit.com/r/Cooking/comments/dcjbiz/never_cooked_pork_butt_butcherbox_just_sent_a_618/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 10,
      "title": "Is mixing cuts of beef for Boeuf Bourguignon the worst Christmas dinner mistake I'll ever make?",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.950 | TextBlob: -0.150 | Negative words: ['terrible', 'bad', 'worst']",
      "url": "https://reddit.com/r/Cooking/comments/1hkv5en/is_mixing_cuts_of_beef_for_boeuf_bourguignon_the/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 11,
      "title": "What are some interesting ground beef recipes?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.394 | TextBlob: 0.121 | Positive words: ['good']",
      "url": "https://reddit.com/r/Cooking/comments/1hislsn/what_are_some_interesting_ground_beef_recipes/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 12,
      "title": "Lazy Fish Tacos",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.507 | TextBlob: 0.333",
      "url": "https://reddit.com/r/Cooking/comments/1ggopsd/lazy_fish_tacos/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 13,
      "title": "Putting together a butcher box for a college student..help!",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.860 | TextBlob: -0.009 | Positive words: ['good', 'worth']",
      "url": "https://reddit.com/r/Cooking/comments/190v3hc/putting_together_a_butcher_box_for_a_college/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 14,
      "title": "Worth going to a local chicken farm?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.954 | TextBlob: 0.073 | Positive words: ['good', 'worth', 'quality']",
      "url": "https://reddit.com/r/Cooking/comments/16hy6qh/worth_going_to_a_local_chicken_farm/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 15,
      "title": "Does anyone have a favorite meat delivery service ? Was looking at force of nature and butcher box as top options to buy in bulk",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.586 | TextBlob: 0.500",
      "url": "https://reddit.com/r/Cooking/comments/15a7n9m/does_anyone_have_a_favorite_meat_delivery_service/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 16,
      "title": "Reheating Brisket Question",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.544 | TextBlob: -0.076",
      "url": "https://reddit.com/r/Cooking/comments/y5d5mf/reheating_brisket_question/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 17,
      "title": "Help - I have 12lb of pork butt..",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.402 | TextBlob: 0.275",
      "url": "https://reddit.com/r/Cooking/comments/sg1op1/help_i_have_12lb_of_pork_butt/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 18,
      "title": "Organic ground chicken with weird taste and smell, within sell by date!?",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.524 | TextBlob: -0.234 | Positive words: ['love'] | Negative words: ['waste']",
      "url": "https://reddit.com/r/Cooking/comments/rkaqe6/organic_ground_chicken_with_weird_taste_and_smell/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 19,
      "title": "Cooking a brisket without a smoker",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.688 | TextBlob: -0.143",
      "url": "https://reddit.com/r/Cooking/comments/rjx9kr/cooking_a_brisket_without_a_smoker/"
    },
    {
      "brand": "ButcherBox",
      "post_number": 20,
      "title": "My dad's perfectly boiled White Cut Chicken (白切鸡) &amp; Ginger Scallion Sauce (姜葱酱)! AKA Poached Whole Chicken or Bak Chit Gai, it's a simple, traditional, and almost-required dish for Lunar New Year, tied with many auspicious sayings and superstitions.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 1.000 | TextBlob: 0.009 | Positive words: ['love', 'great', 'good', 'recommend', 'fresh', 'easy'] | Negative words: ['waste']",
      "url": "https://reddit.com/r/Cooking/comments/l0zkw2/my_dads_perfectly_boiled_white_cut_chicken_白切鸡/"
    },
    {
      "brand": "Home Chef",
      "post_number": 1,
      "title": "Other Meal Kits",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/"
    },
    {
      "brand": "Home Chef",
      "post_number": 2,
      "title": "nyone switch from HelloFresh to Marley Spoon or Home Chef? Looking for real experiences",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.925 | TextBlob: 0.008 | Positive words: ['love', 'fresh'] | Negative words: ['worst']",
      "url": "https://reddit.com/r/hellofresh/comments/1nusayf/nyone_switch_from_hellofresh_to_marley_spoon_or/"
    },
    {
      "brand": "Home Chef",
      "post_number": 3,
      "title": "Chicken Pita Pockets/Green Goddess Salad",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.861 | TextBlob: 0.121 | Positive words: ['love', 'fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1mdc77n/chicken_pita_pocketsgreen_goddess_salad/"
    },
    {
      "brand": "Home Chef",
      "post_number": 4,
      "title": "HelloFresh alternatives that let you view upcoming menus before charging your CC?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.710 | TextBlob: -0.103 | Positive words: ['fresh', 'quality'] | Negative words: ['awful', 'waste']",
      "url": "https://reddit.com/r/hellofresh/comments/1lcvxbd/hellofresh_alternatives_that_let_you_view/"
    },
    {
      "brand": "Home Chef",
      "post_number": 5,
      "title": "Hello Fresh or Home Chef",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.948 | TextBlob: 0.222 | Positive words: ['good', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1kzglf4/hello_fresh_or_home_chef/"
    },
    {
      "brand": "Home Chef",
      "post_number": 6,
      "title": "Blocked from Hello Fresh?!",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.636 | TextBlob: 0.263 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1km2eos/blocked_from_hello_fresh/"
    },
    {
      "brand": "Home Chef",
      "post_number": 7,
      "title": "Working on a project from hello fresh and need some input.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/"
    },
    {
      "brand": "Home Chef",
      "post_number": 8,
      "title": "HORRIBLE customer service",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.288 | TextBlob: -0.100 | Positive words: ['fresh', 'helpful'] | Negative words: ['horrible']",
      "url": "https://reddit.com/r/hellofresh/comments/1ifdd3y/horrible_customer_service/"
    },
    {
      "brand": "Home Chef",
      "post_number": 9,
      "title": "Switching to Home Chef?",
      "sentiment": "neutral",
      "confidence": 0.7,
      "explanation": "VADER: 0.000 | TextBlob: 0.000",
      "url": "https://reddit.com/r/hellofresh/comments/1giqzms/switching_to_home_chef/"
    },
    {
      "brand": "Home Chef",
      "post_number": 10,
      "title": "Hellofresh vs homechef",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.879 | TextBlob: 0.107 | Positive words: ['fresh', 'satisfied']",
      "url": "https://reddit.com/r/hellofresh/comments/1f1dx4b/hellofresh_vs_homechef/"
    },
    {
      "brand": "Home Chef",
      "post_number": 11,
      "title": "Well mouldy food is the end for me",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.214 | TextBlob: 0.129 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1eineye/well_mouldy_food_is_the_end_for_me/"
    },
    {
      "brand": "Home Chef",
      "post_number": 12,
      "title": "Meat Quality (tough chicken breasts)",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.665 | TextBlob: -0.546 | Positive words: ['quality'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/hellofresh/comments/1dwo78o/meat_quality_tough_chicken_breasts/"
    },
    {
      "brand": "Home Chef",
      "post_number": 13,
      "title": "Introductory offer?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.945 | TextBlob: 0.185 | Positive words: ['love']",
      "url": "https://reddit.com/r/hellofresh/comments/1dqns39/introductory_offer/"
    },
    {
      "brand": "Home Chef",
      "post_number": 14,
      "title": "Marley Spoon Comparison",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.969 | TextBlob: 0.169 | Positive words: ['love', 'good']",
      "url": "https://reddit.com/r/hellofresh/comments/1cmn0i3/marley_spoon_comparison/"
    },
    {
      "brand": "Home Chef",
      "post_number": 15,
      "title": "Better promotion?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.994 | TextBlob: 0.197 | Positive words: ['fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1b2p4rf/better_promotion/"
    },
    {
      "brand": "Home Chef",
      "post_number": 16,
      "title": "Other meal kits you prefer?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.553 | TextBlob: 0.063 | Positive words: ['quality', 'happy'] | Negative words: ['issues']",
      "url": "https://reddit.com/r/hellofresh/comments/1amxs35/other_meal_kits_you_prefer/"
    },
    {
      "brand": "Home Chef",
      "post_number": 17,
      "title": "Thinking about trying a different meal service",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.878 | TextBlob: 0.027 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/18nzo27/thinking_about_trying_a_different_meal_service/"
    },
    {
      "brand": "Home Chef",
      "post_number": 18,
      "title": "Delivery via Fareye",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.849 | TextBlob: 0.038 | Positive words: ['good', 'fresh'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/hellofresh/comments/18hi2vf/delivery_via_fareye/"
    },
    {
      "brand": "Home Chef",
      "post_number": 19,
      "title": "First time trying hello fresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.886 | TextBlob: 0.245 | Positive words: ['fresh', 'worth']",
      "url": "https://reddit.com/r/hellofresh/comments/185cdna/first_time_trying_hello_fresh/"
    },
    {
      "brand": "Home Chef",
      "post_number": 20,
      "title": "Questions before I switch to Hello Fresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.925 | TextBlob: 0.077 | Positive words: ['fresh'] | Negative words: ['issues']",
      "url": "https://reddit.com/r/hellofresh/comments/17veq60/questions_before_i_switch_to_hello_fresh/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 1,
      "title": "Other Meal Kits",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.528 | TextBlob: 0.008 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1o2npqt/other_meal_kits/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 2,
      "title": "Recreate Dishes",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.810 | TextBlob: 0.140 | Positive words: ['fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/1nc80nk/recreate_dishes/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 3,
      "title": "Blue Apron is doing too much.",
      "sentiment": "positive",
      "confidence": 0.6,
      "explanation": "VADER: 0.178 | TextBlob: 0.167 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1misdaz/blue_apron_is_doing_too_much/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 4,
      "title": "Canceling HelloFresh after two years",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.901 | TextBlob: -0.062 | Positive words: ['fresh', 'quality', 'easy'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/hellofresh/comments/1k4pa4i/canceling_hellofresh_after_two_years/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 5,
      "title": "Working on a project from hello fresh and need some input.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 6,
      "title": "Blue Apron v. Hello Fresh",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.999 | TextBlob: 0.136 | Positive words: ['love', 'good', 'delicious', 'fresh', 'quality', 'easy'] | Negative words: ['awful', 'issues']",
      "url": "https://reddit.com/r/hellofresh/comments/1j6tuki/blue_apron_v_hello_fresh/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 7,
      "title": "Survey to understand meal kit services",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.948 | TextBlob: 0.198 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1j0bxw0/survey_to_understand_meal_kit_services/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 8,
      "title": "New customer: Shipping times ",
      "sentiment": "neutral",
      "confidence": 0.7,
      "explanation": "VADER: -0.039 | TextBlob: 0.003",
      "url": "https://reddit.com/r/hellofresh/comments/1h6pnxs/new_customer_shipping_times/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 9,
      "title": "Already prepped meals?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.728 | TextBlob: 0.067",
      "url": "https://reddit.com/r/hellofresh/comments/1dy8k77/already_prepped_meals/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 10,
      "title": "Does Hello Fresh use OnTrac to deliver? (US)",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.883 | TextBlob: 0.050 | Positive words: ['fresh'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/hellofresh/comments/1drgzy8/does_hello_fresh_use_ontrac_to_deliver_us/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 11,
      "title": "How do you prep the chicken mush?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.846 | TextBlob: -0.179 | Positive words: ['fresh'] | Negative words: ['disappointed']",
      "url": "https://reddit.com/r/hellofresh/comments/1d6ru3i/how_do_you_prep_the_chicken_mush/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 12,
      "title": "HelloFresh promos are bait-and-switches",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.946 | TextBlob: 0.176 | Positive words: ['great', 'fresh'] | Negative words: ['hate']",
      "url": "https://reddit.com/r/hellofresh/comments/1ay3eq1/hellofresh_promos_are_baitandswitches/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 13,
      "title": "Anyone else disappointed after coming back?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.985 | TextBlob: 0.022 | Positive words: ['great', 'worth'] | Negative words: ['hate', 'disappointed']",
      "url": "https://reddit.com/r/hellofresh/comments/18u93ny/anyone_else_disappointed_after_coming_back/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 14,
      "title": "Thinking about trying a different meal service",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.878 | TextBlob: 0.027 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/18nzo27/thinking_about_trying_a_different_meal_service/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 15,
      "title": "Why Blue Apron and Hello Fresh can't keep their customers",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.686 | TextBlob: 0.317 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/171gdvq/why_blue_apron_and_hello_fresh_cant_keep_their/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 16,
      "title": "Was trying out different meal kits",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.203 | TextBlob: -0.016 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/15bd66e/was_trying_out_different_meal_kits/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 17,
      "title": "Look for a switch",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.955 | TextBlob: 0.096 | Positive words: ['love', 'great', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/13p0vlr/look_for_a_switch/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 18,
      "title": "Potatoe’s",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.926 | TextBlob: 0.229 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/139aoc8/potatoes/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 19,
      "title": "Has anyone tried other food meal kit delivery options?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.664 | TextBlob: 0.117 | Positive words: ['good']",
      "url": "https://reddit.com/r/hellofresh/comments/yilhkh/has_anyone_tried_other_food_meal_kit_delivery/"
    },
    {
      "brand": "Blue Apron",
      "post_number": 20,
      "title": "It is finally happening",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.629 | TextBlob: -0.006 | Positive words: ['easy'] | Negative words: ['bad']",
      "url": "https://reddit.com/r/hellofresh/comments/yb33tn/it_is_finally_happening/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 1,
      "title": "Hungryroot vs HF?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.959 | TextBlob: 0.040 | Positive words: ['good', 'fresh'] | Negative words: ['hate']",
      "url": "https://reddit.com/r/hellofresh/comments/159c3va/hungryroot_vs_hf/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 2,
      "title": "Vegetarian/ Vegan friendly?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.959 | TextBlob: 0.273 | Positive words: ['good', 'fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/uzd88b/vegetarian_vegan_friendly/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 3,
      "title": "How easy is it to cancel service?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.941 | TextBlob: 0.074 | Positive words: ['fresh', 'easy']",
      "url": "https://reddit.com/r/hellofresh/comments/udit42/how_easy_is_it_to_cancel_service/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 4,
      "title": "Working on a project from hello fresh and need some input.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.813 | TextBlob: 0.082 | Positive words: ['fresh']",
      "url": "https://reddit.com/r/hellofresh/comments/1jut0ie/working_on_a_project_from_hello_fresh_and_need/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 5,
      "title": "Honest Hungryroot review",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.993 | TextBlob: 0.112 | Positive words: ['good', 'fresh', 'easy', 'tasty'] | Negative words: ['hate', 'awful', 'bad', 'spoiled', 'issues']",
      "url": "https://reddit.com/r/mealkits/comments/1o91859/honest_hungryroot_review/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 6,
      "title": "Dos Hungry root give smaller portions and snacks overtime?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.353 | TextBlob: 0.003 | Positive words: ['good']",
      "url": "https://reddit.com/r/mealkits/comments/1nztubg/dos_hungry_root_give_smaller_portions_and_snacks/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 7,
      "title": "Hungryroot -- would be great if they weren't so unreliable",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.425 | TextBlob: 0.083 | Positive words: ['great', 'easy'] | Negative words: ['waste', 'problems', 'issues']",
      "url": "https://reddit.com/r/mealkits/comments/1nuqk0s/hungryroot_would_be_great_if_they_werent_so/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 8,
      "title": "Better oils in premade meal kits?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.254 | TextBlob: 0.003 | Negative words: ['hate']",
      "url": "https://reddit.com/r/mealkits/comments/1nubt6c/better_oils_in_premade_meal_kits/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 9,
      "title": "Heart healthy, low sodium",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.911 | TextBlob: 0.124 | Positive words: ['great'] | Negative words: ['issues']",
      "url": "https://reddit.com/r/mealkits/comments/1npszp7/heart_healthy_low_sodium/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 10,
      "title": "Hungryroot review, pleasantly surprised",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.972 | TextBlob: 0.137 | Positive words: ['great', 'good', 'recommend'] | Negative words: ['waste']",
      "url": "https://reddit.com/r/mealkits/comments/1ni62gr/hungryroot_review_pleasantly_surprised/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 11,
      "title": "Unauthorized Charges and No Customer Support",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.747 | TextBlob: -0.125",
      "url": "https://reddit.com/r/mealkits/comments/1nblkt1/unauthorized_charges_and_no_customer_support/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 12,
      "title": "Meal prep service",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.918 | TextBlob: 0.293 | Positive words: ['easy']",
      "url": "https://reddit.com/r/mealkits/comments/1n8rp09/meal_prep_service/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 13,
      "title": "Any meal kits out there w/o seed oils?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.168 | TextBlob: 0.158 | Positive words: ['good', 'quality'] | Negative words: ['spoiled']",
      "url": "https://reddit.com/r/mealkits/comments/1n7rdw2/any_meal_kits_out_there_wo_seed_oils/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 14,
      "title": "No, seriously - BEWARE OF HUNGRY ROOT! How are they still around?!",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.971 | TextBlob: 0.023 | Positive words: ['great', 'easy'] | Negative words: ['hate', 'bad', 'worst', 'issues']",
      "url": "https://reddit.com/r/mealkits/comments/1mvddu7/no_seriously_beware_of_hungry_root_how_are_they/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 15,
      "title": "New to HungryRoot - DO NOT RECOMMEND",
      "sentiment": "negative",
      "confidence": 0.8,
      "explanation": "VADER: -0.184 | TextBlob: -0.020 | Positive words: ['recommend'] | Negative words: ['spoiled', 'issues']",
      "url": "https://reddit.com/r/mealkits/comments/1mmx5jl/new_to_hungryroot_do_not_recommend/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 16,
      "title": "Hungryroot is a ripoff.",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.625 | TextBlob: 0.179",
      "url": "https://reddit.com/r/mealkits/comments/1m2reqs/hungryroot_is_a_ripoff/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 17,
      "title": "Hungryroot Review After 2 Weeks",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.459 | TextBlob: 0.104 | Positive words: ['fresh', 'worth', 'quality'] | Negative words: ['terrible']",
      "url": "https://reddit.com/r/mealkits/comments/1lpg6lx/hungryroot_review_after_2_weeks/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 18,
      "title": "Alternative to Hungryroot?",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.991 | TextBlob: 0.327 | Positive words: ['love', 'great', 'fresh']",
      "url": "https://reddit.com/r/mealkits/comments/1l7hl22/alternative_to_hungryroot/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 19,
      "title": "Hungryroot",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: -0.437 | TextBlob: 0.625 | Negative words: ['issues']",
      "url": "https://reddit.com/r/mealkits/comments/1l4guk9/hungryroot/"
    },
    {
      "brand": "HungryRoot",
      "post_number": 20,
      "title": "Weekly meals, side dishes only?!",
      "sentiment": "positive",
      "confidence": 0.8,
      "explanation": "VADER: 0.956 | TextBlob: 0.068 | Positive words: ['good', 'quality']",
      "url": "https://reddit.com/r/mealkits/comments/1l31ia9/weekly_meals_side_dishes_only/"
    }
  ]
}